STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_usb_otg_core.c
/**
  ******************************************************************************
  * @file    stm32u5xx_usb_otg_core.c
  * @brief   USB Core OTG driver.
  *
  *          This file provides firmware functions to manage the following
  *          functionalities of the USB Peripheral Controller:
  *           + Initialization/de-initialization functions
  *           + I/O operation functions
  *           + Peripheral Control functions
  *           + Peripheral State functions
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  @verbatim
  ==============================================================================
                    ##### How to use this driver #####
  ==============================================================================
    [..]
      (#) Fill parameters of core config structure in usb_core_config_params_t structure.

      (#) Call USB_OTG_InitCore() API to initialize the USB Core peripheral.

      (#) The upper HAL HCD/PCD driver will call the right routines for its internal processes.

  @endverbatim

  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32u5xx_usb_otg_core.h"

/** @addtogroup STM32U5xx_HAL_Driver
  * @{
  */

#if defined (USB_OTG_FS) || defined (USB_OTG_HS)
/** @defgroup USB_OTG_CORE USB OTG CORE
  * @{
  */

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes ---------------------------------------------------------------------------------------*/
/** @defgroup USB_OTG_Core_Private_Functions USB OTG Core Private Functions
  * @{
  */
static usb_core_status_t USB_OTG_ResetCore(uint32_t instance);
/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @addtogroup USB_OTG_Core_Private_Functions USB OTG Core Private Functions
  * @{
  */
/**
  * @brief  Reset the USB Core (needed after USB clock settings change)
  * @param  instance  Selected device
  * @retval OTG Core status
  */
static usb_core_status_t USB_OTG_ResetCore(uint32_t instance)
{
  usb_otg_global_t *p_usb = USB_OTG_GET_INSTANCE(instance);
  __IO uint32_t count = 0U;

  /* Wait for AHB master IDLE state. */
  do
  {
    count++;

    if (count > USB_OTG_TIMEOUT)
    {
      return USB_CORE_ERROR;
    }
  } while ((p_usb->GRSTCTL & USB_OTG_GRSTCTL_AHBIDL) == 0U);

  /* Wait few cycles before setting core reset */
  count = 10U;

  while (count > 0U)
  {
    count--;
  }

  /* Core Soft Reset */
  p_usb->GRSTCTL |= USB_OTG_GRSTCTL_CSRST;

  do
  {
    count++;

    if (count > USB_OTG_TIMEOUT)
    {
      return USB_CORE_ERROR;
    }
  } while ((p_usb->GRSTCTL & USB_OTG_GRSTCTL_CSRST) == USB_OTG_GRSTCTL_CSRST);

  return USB_CORE_OK;
}

/**
  * @}
  */

/** @defgroup USB_OTG_Core_Exported_Functions USB Low Layer Exported Functions
  * @{
  */

/** @defgroup USB_OTG_Core_Exported_Functions_Group1 Initialization/de-initialization functions
  *  @brief    Initialization and Configuration functions
  *
@verbatim
 ===============================================================================
                      ##### Initialization/de-initialization functions #####
 ===============================================================================

@endverbatim
  * @{
  */

/**
  * @brief  Initializes the USB Core
  * @param  instance USB Instance
  * @param  p_core_config USB Instance configuration parameters
  * @retval OTG Core status
  */
usb_core_status_t USB_OTG_InitCore(uint32_t instance, const usb_core_config_params_t *p_core_config)
{
  usb_core_status_t ret = USB_CORE_OK;
  usb_otg_global_t *p_usb = USB_OTG_GET_INSTANCE(instance);

#if defined (USB_OTG_HS)
  if (p_core_config->phy_interface == USB_CORE_PHY_EMBEDDED_HS)
  {
    /* Init The UTMI Interface */
    p_usb->GUSBCFG &= ~(USB_OTG_GUSBCFG_TSDPS);
  }

  /* Reset after a PHY select */
  ret = USB_OTG_ResetCore(instance);

  if (p_core_config->dma_state == USB_CORE_CONFIG_ENABLED)
  {
    p_usb->GAHBCFG |= USB_OTG_GAHBCFG_HBSTLEN_2;
    p_usb->GAHBCFG |= USB_OTG_GAHBCFG_DMAEN;
  }

#else

  /* Select FS Embedded PHY */
  p_usb->GUSBCFG |= USB_OTG_GUSBCFG_PHYSEL;

  /* Reset after a PHY select */
  ret = USB_OTG_ResetCore(instance);

  if (p_core_config->bcd_state == USB_CORE_CONFIG_DISABLED)
  {
    /* Activate the USB Transceiver */
    p_usb->GCCFG |= USB_OTG_GCCFG_PWRDWN;
  }
  else
  {
    /* Deactivate the USB Transceiver */
    p_usb->GCCFG &= ~(USB_OTG_GCCFG_PWRDWN);
  }
#endif /* defined (USB_OTG_HS) */

  return ret;
}

/**
  * @brief  Deinitializes the USB Core
  * @param  instance USB Instance
  * @retval OTG Core status
  */
usb_core_status_t USB_OTG_DeInitCore(uint32_t instance)
{
  STM32_UNUSED(instance);

  return USB_CORE_OK;
}

/**
  * @}
  */

/** @defgroup USB_OTG_Core_Exported_Functions_Group2 Input and Output operation functions
  *  @brief   Data transfers functions
  *
@verbatim
 ===============================================================================
                      ##### IO operation functions #####
 ===============================================================================
    [..]
    This subsection provides a set of functions allowing to manage the LL data
    transfers.

@endverbatim
  * @{
  */

/**
  * @brief  USB_OTG_EnableGlobalInterrupt
  *         Enables the controller's Global Int in the AHB Config reg
  * @param  instance  Selected device
  * @retval OTG Core status
  */
usb_core_status_t USB_OTG_EnableGlobalInterrupt(uint32_t instance)
{
  usb_otg_global_t *p_usb = USB_OTG_GET_INSTANCE(instance);
  p_usb->GAHBCFG |= USB_OTG_GAHBCFG_GINT;
  return USB_CORE_OK;
}

/**
  * @brief  USB_OTG_DisableGlobalInterrupt
  *         Disable the controller's Global Int in the AHB Config reg
  * @param  instance  Selected device
  * @retval OTG Core status
  */
usb_core_status_t USB_OTG_DisableGlobalInterrupt(uint32_t instance)
{
  usb_otg_global_t *p_usb = USB_OTG_GET_INSTANCE(instance);
  p_usb->GAHBCFG &= ~USB_OTG_GAHBCFG_GINT;
  return USB_CORE_OK;
}

/**
  * @brief  USB_OTG_SetCurrentMode Set functional mode
  * @param  instance  Selected device
  * @param  core_mode  current core mode
  *          This parameter can be one of these values:
  *            @arg USB_CORE_DEVICE_MODE Peripheral mode
  *            @arg USB_CORE_HOST_MODE Host mode
  * @retval USB_CORE_OK
  */
usb_core_status_t USB_OTG_SetCurrentMode(uint32_t instance, usb_core_mode_t core_mode)
{
  usb_otg_global_t *p_usb = USB_OTG_GET_INSTANCE(instance);

  p_usb->GUSBCFG &= ~(USB_OTG_GUSBCFG_FHMOD | USB_OTG_GUSBCFG_FDMOD);

  if (core_mode == USB_CORE_HOST_MODE)
  {
    p_usb->GUSBCFG |= USB_OTG_GUSBCFG_FHMOD;
  }
  else if (core_mode == USB_CORE_DEVICE_MODE)
  {
    p_usb->GUSBCFG |= USB_OTG_GUSBCFG_FDMOD;
  }
  else
  {
    return USB_CORE_ERROR;
  }

  return USB_CORE_OK;
}

/**
  * @brief  Returns USB core mode
  * @param  instance  Selected device
  * @retval return core mode : Host or Device
  *          This parameter can be one of these values:
  *           0 : USB_CORE_DEVICE_MODE
  *           1 : USB_CORE_HOST_MODE
  */
usb_core_mode_t USB_OTG_GetCurrentMode(uint32_t instance)
{
  const usb_otg_global_t *p_usb = USB_OTG_GET_INSTANCE(instance);
  uint32_t current_mode = (p_usb->GINTSTS) & USB_OTG_GINTSTS_CMOD;

  return (usb_core_mode_t)current_mode;
}


/**
  * @brief  Set BCD mode.
  * @param  instance Selected device
  * @param  bcd_config BCD configuration
  * @param  bcd_sts BCD OTG Core status
  */
usb_core_status_t USB_OTG_BCD_SetMode(uint32_t instance, usb_core_bcd_config_t bcd_config,
                                      usb_core_bcd_config_sts_t bcd_sts)
{
  usb_otg_global_t *p_usb = USB_OTG_GET_INSTANCE(instance);

