STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_usb_otg_core.c
  switch (bcd_config)
  {
    case USB_CORE_BCD_CONFIG_DCD:
      if (bcd_sts == USB_CORE_BCD_CONFIG_STS_SET)
      {
        p_usb->GCCFG |= USB_OTG_GCCFG_DCDEN;
      }
      else
      {
        p_usb->GCCFG &= ~USB_OTG_GCCFG_DCDEN;
      }
      break;

    case USB_CORE_BCD_CONFIG_PD:
      if (bcd_sts == USB_CORE_BCD_CONFIG_STS_SET)
      {
        p_usb->GCCFG |= USB_OTG_GCCFG_PDEN;
      }
      else
      {
        p_usb->GCCFG &= ~USB_OTG_GCCFG_PDEN;
      }
      break;

    case USB_CORE_BCD_CONFIG_SD:
      if (bcd_sts == USB_CORE_BCD_CONFIG_STS_SET)
      {
        p_usb->GCCFG |= USB_OTG_GCCFG_SDEN;
      }
      else
      {
        p_usb->GCCFG &= ~USB_OTG_GCCFG_SDEN;
      }
      break;

    default:
      return USB_CORE_ERROR;
      break;
  }
  return USB_CORE_OK;
}

/**
  * @brief  Port Type Detection Process.
  * @param  instance Selected device
  * @param  detection BCD Primary and Secondary detection
  * @retval port detection status
  */
usb_core_bcd_port_status_t USB_OTG_BCD_PortTypeDetection(uint32_t instance, usb_core_bcd_detection_t detection)
{
  usb_otg_global_t *p_usb = USB_OTG_GET_INSTANCE(instance);
  usb_core_bcd_port_status_t port_detection_status = USB_CORE_BCD_PORT_STATUS_DEFAULT;

  if (detection == USB_CORE_BCD_PRIMARY_DETECTION)
  {
#if defined (STM32U575xx) || defined (STM32U585xx)
    if ((p_usb->GCCFG & USB_OTG_GCCFG_PDET) == 0U)
#else
    if ((p_usb->GCCFG & USB_OTG_GCCFG_CHGDET) == 0U)
#endif /* defined (STM32U575xx) || defined (STM32U585xx) */
    {
      port_detection_status = USB_CORE_BCD_PORT_STATUS_STD_DOWNSTREAM;
    }
    else
    {
      port_detection_status = USB_CORE_BCD_PORT_STATUS_NOT_STD_DOWNSTREAM;
    }
  }
  else
  {
    /* Start secondary detection to check connection to Charging Downstream
    Port or Dedicated Charging Port */
#if defined (STM32U575xx) || defined (STM32U585xx)
    if ((p_usb->GCCFG & USB_OTG_GCCFG_SDET) == USB_OTG_GCCFG_SDET)
#else
    if ((p_usb->GCCFG & USB_OTG_GCCFG_FSVPLUS) == USB_OTG_GCCFG_FSVPLUS)
#endif /* defined (STM32U575xx) || defined (STM32U585xx) */
    {
      port_detection_status = USB_CORE_BCD_PORT_STATUS_DEDICATED_CHARGING;
    }
    else
    {
      port_detection_status = USB_CORE_BCD_PORT_STATUS_CHARGING_DOWNSTREAM;
    }
  }

  return port_detection_status;
}

/**
  * @brief  Activate BCD feature
  * @param  instance selected device
  * @retval OTG Core status
  */
usb_core_status_t USB_OTG_BCD_Activate(uint32_t instance)
{
  usb_otg_global_t *p_usb = USB_OTG_GET_INSTANCE(instance);

  p_usb->GCCFG &= ~(USB_OTG_GCCFG_PDEN);
  p_usb->GCCFG &= ~(USB_OTG_GCCFG_SDEN);

#if defined (STM32U575xx) || defined (STM32U585xx)
  /* Power Down USB transceiver  */
  p_usb->GCCFG &= ~(USB_OTG_GCCFG_PWRDWN);

  /* Enable Battery charging */
  p_usb->GCCFG |= USB_OTG_GCCFG_BCDEN;
#endif /* defined (STM32U575xx) || defined (STM32U585xx) */

  return USB_CORE_OK;
}

/**
  * @brief  DeActivate BCD feature
  * @param  instance selected device
  * @retval OTG Core status
  */
usb_core_status_t USB_OTG_BCD_DeActivate(uint32_t instance)
{
  usb_otg_global_t *p_usb = USB_OTG_GET_INSTANCE(instance);

  p_usb->GCCFG &= ~(USB_OTG_GCCFG_SDEN);
  p_usb->GCCFG &= ~(USB_OTG_GCCFG_PDEN);

#if defined (STM32U575xx) || defined (STM32U585xx)
  /* Disable Battery charging */
  p_usb->GCCFG &= ~(USB_OTG_GCCFG_BCDEN);
#endif /* defined (STM32U575xx) || defined (STM32U585xx) */

  return USB_CORE_OK;
}

/**
  * @brief  USB_ActivateRemoteWakeup active remote wakeup signalling
  * @param  instance Selected device
  * @retval OTG Core status
  */
usb_core_status_t USB_OTG_ActivateRemoteWakeup(uint32_t instance)
{
  if ((USB_OTG_DEVICE(instance)->DSTS & USB_OTG_DSTS_SUSPSTS) == USB_OTG_DSTS_SUSPSTS)
  {
    /* Active Remote wakeup signalling */
    USB_OTG_DEVICE(instance)->DCTL |= USB_OTG_DCTL_RWUSIG;
  }

  return USB_CORE_OK;
}

/**
  * @brief  USB_DeActivateRemoteWakeup de-active remote wakeup signalling
  * @param  instance Selected device
  * @retval OTG Core status
  */
usb_core_status_t USB_OTG_DeActivateRemoteWakeup(uint32_t instance)
{
  /* Active Remote wakeup signalling */
  USB_OTG_DEVICE(instance)->DCTL &= ~(USB_OTG_DCTL_RWUSIG);

  return USB_CORE_OK;
}


/**
  * @brief  USB_OTG_WritePacket : Writes a packet into the Tx FIFO associated
  *         with the EP/channel
  * @param  instance  Selected device
  * @param  p_src  pointer to source buffer
  * @param  ch_ep_num  endpoint or host channel number
  * @param  size_byte  Number of bytes to write
  * @retval OTG Core status
  */
usb_core_status_t USB_OTG_WritePacket(uint32_t instance, const uint8_t *p_src, uint8_t ch_ep_num, uint32_t size_byte)
{
  const usb_otg_global_t *p_usb = USB_OTG_GET_INSTANCE(instance);
  const uint8_t *p_src_buffer = p_src;
  uint32_t count32b;
  uint32_t count_idx;

  if ((p_usb->GAHBCFG & USB_OTG_GAHBCFG_DMAEN) == 0U)
  {
    count32b = ((uint32_t)size_byte + 3U) / 4U;
    for (count_idx = 0U; count_idx < count32b; count_idx++)
    {
      USB_OTG_DFIFO(instance, ch_ep_num) = __UNALIGNED_UINT32_READ(p_src_buffer);
      p_src_buffer++;
      p_src_buffer++;
      p_src_buffer++;
      p_src_buffer++;
    }
  }

  return USB_CORE_OK;
}

/**
  * @brief  USB_OTG_ReadPacket : read a packet from the RX FIFO
  * @param  instance   Selected device
  * @param  p_dest     channel or endpoint number
  * @param  ch_ep_num  source pointer
  * @param  size_byte  Number of bytes to read
  * @retval pointer to destination buffer
  */
void *USB_OTG_ReadPacket(uint32_t instance, uint8_t *p_dest, uint8_t ch_ep_num, uint32_t size_byte)
{
  uint8_t *p_dest_buffer = p_dest;
  uint32_t data;
  uint32_t count_idx;
  uint32_t count32b = (uint32_t)size_byte >> 2U;
  uint32_t remaining_bytes = size_byte % 4U;

  STM32_UNUSED(ch_ep_num);

  for (count_idx = 0U; count_idx < count32b; count_idx++)
  {
    __UNALIGNED_UINT32_WRITE(p_dest_buffer, USB_OTG_DFIFO(instance, 0U));
    p_dest_buffer++;
    p_dest_buffer++;
    p_dest_buffer++;
    p_dest_buffer++;
  }

