STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_usb_otg_core.c
  /* When Number of data is not word aligned, read the remaining byte */
  if (remaining_bytes != 0U)
  {
    count_idx = 0U;
    __UNALIGNED_UINT32_WRITE(&data, USB_OTG_DFIFO(instance, 0U));

    do
    {
      *(uint8_t *)p_dest_buffer = (uint8_t)(data >> (8U * (uint8_t)(count_idx)));
      count_idx++;
      p_dest_buffer++;
      remaining_bytes--;
    } while (remaining_bytes != 0U);
  }

  return ((void *)p_dest_buffer);
}

/**
  * @brief  USB_OTG_ReadInterrupts: return the global USB interrupt status
  * @param  instance  Selected device
  * @retval USB Global Interrupt status
  */
uint32_t USB_OTG_ReadInterrupts(uint32_t instance)
{
  const usb_otg_global_t *p_usb = USB_OTG_GET_INSTANCE(instance);
  uint32_t gintsts_reg;

  gintsts_reg = p_usb->GINTSTS;
  gintsts_reg &= p_usb->GINTMSK;

  return gintsts_reg;
}

/**
  * @brief  USB_OTG_ClearInterrupts: clear a USB interrupt
  * @param  instance  Selected device
  * @param  interrupt  flag
  */
void USB_OTG_ClearInterrupts(uint32_t instance, uint32_t interrupt)
{
  usb_otg_global_t *p_usb = USB_OTG_GET_INSTANCE(instance);
  p_usb->GINTSTS &= interrupt;
}

/**
  * @brief  Set Tx FIFO Size
  * @param  instance selected device
  * @param  fifo number
  * @param  size_words fifo size in words
  * @retval HAL OTG Core status
  */
usb_core_status_t USB_OTG_SetTxFiFoSize(uint32_t instance, uint8_t fifo, uint16_t size_words)
{
  usb_otg_global_t *p_usb = USB_OTG_GET_INSTANCE(instance);
  uint8_t fifo_idx;
  uint32_t Tx_Offset;

  /*  TXn min size = 16 32bits words. (n  : Transmit FIFO index)
      When a TxFIFO is not used, the Configuration to be as follows:
          case 1 :  n > m    and Txn is not used    (n,m  : Transmit FIFO indexes)
         --> Txm can use the space allocated for Txn.
         case2  :  n < m    and Txn is not used    (n,m  : Transmit FIFO indexes)
         --> Txn to be configured with the minimum space of 16 words
     The FIFO is used optimally when used TxFIFOs are allocated in the top
         of the FIFO.Ex: use EP1 and EP2 as IN instead of EP1 and EP3 as IN ones.
     When DMA is used 3n * FIFO locations to be reserved for internal DMA registers */

  Tx_Offset = p_usb->GRXFSIZ;

  if (fifo == 0U)
  {
    p_usb->DIEPTXF0_HNPTXFSIZ = ((uint32_t)size_words << 16) | Tx_Offset;
  }
  else
  {
    Tx_Offset += (p_usb->DIEPTXF0_HNPTXFSIZ) >> 16;
    for (fifo_idx = 0U; fifo_idx < (fifo - 1U); fifo_idx++)
    {
      Tx_Offset += (p_usb->DIEPTXF[fifo_idx] >> 16);
    }

    /* Multiply Tx_Size by 2 to get higher performance */
    p_usb->DIEPTXF[fifo - 1U] = ((uint32_t)size_words << 16) | Tx_Offset;
  }

  return USB_CORE_OK;
}

/**
  * @brief  Set Rx FIFO Size
  * @param  instance selected device
  * @param  size_words fifo size in words
  * @retval OTG Core status
  */
usb_core_status_t USB_OTG_SetRxFiFoSize(uint32_t instance, uint16_t size_words)
{
  usb_otg_global_t *p_usb = USB_OTG_GET_INSTANCE(instance);

  p_usb->GRXFSIZ = size_words;

  return USB_CORE_OK;
}

/**
  * @}
  */

/** @defgroup USB_OTG_CORE_Exported_Functions_Group3 Peripheral Control functions
  *  @brief   management functions
  *
@verbatim
 ===============================================================================
                      ##### Peripheral Control functions #####
 ===============================================================================
    [..]
    This subsection provides a set of functions allowing to control the PCD data
    transfers.

@endverbatim
  * @{
  */


/**
  * @brief  Flush a Tx FIFO
  * @param  instance  Selected device
  * @param  tx_fifo  FIFO number
  *         This parameter can be a value from 1 to 15
            15 means Flush all Tx FIFOs
  * @retval OTG Core status
  */
usb_core_status_t USB_OTG_FlushTxFifo(uint32_t instance, uint32_t tx_fifo)
{
  usb_otg_global_t *p_usb = USB_OTG_GET_INSTANCE(instance);
  __IO uint32_t count = 0U;

  /* Wait for AHB master IDLE state. */
  do
  {
    count++;

    if (count > USB_OTG_TIMEOUT)
    {
      return USB_CORE_ERROR;
    }
  } while ((p_usb->GRSTCTL & USB_OTG_GRSTCTL_AHBIDL) == 0U);

  /* Flush TX Fifo */
  count = 0U;
  p_usb->GRSTCTL = (USB_OTG_GRSTCTL_TXFFLSH | (tx_fifo << 6));

  do
  {
    count++;

    if (count > USB_OTG_TIMEOUT)
    {
      return USB_CORE_ERROR;
    }
  } while ((p_usb->GRSTCTL & USB_OTG_GRSTCTL_TXFFLSH) == USB_OTG_GRSTCTL_TXFFLSH);

  return USB_CORE_OK;
}

/**
  * @brief  USB_OTG_FlushRxFifo  Flush Rx FIFO
  * @param  instance  Selected device
  * @retval OTG Core status
  */
usb_core_status_t USB_OTG_FlushRxFifo(uint32_t instance)
{
  usb_otg_global_t *p_usb = USB_OTG_GET_INSTANCE(instance);
  __IO uint32_t count = 0U;

  /* Wait for AHB master IDLE state. */
  do
  {
    count++;

    if (count > USB_OTG_TIMEOUT)
    {
      return USB_CORE_ERROR;
    }
  } while ((p_usb->GRSTCTL & USB_OTG_GRSTCTL_AHBIDL) == 0U);

  /* Flush RX Fifo */
  count = 0U;
  p_usb->GRSTCTL = USB_OTG_GRSTCTL_RXFFLSH;

  do
  {
    count++;

    if (count > USB_OTG_TIMEOUT)
    {
      return USB_CORE_ERROR;
    }
  } while ((p_usb->GRSTCTL & USB_OTG_GRSTCTL_RXFFLSH) == USB_OTG_GRSTCTL_RXFFLSH);

  return USB_CORE_OK;
}


/**
  * @}
  */

/**
  * @}
  */

/** @defgroup USB_OTG_Core_Device_Exported_Functions USB Core Device Exported Functions
  * @{
  */

/**
  * @brief  Initialize the USB OTG PCD Driver
  * @param  p_driver pointer to USB PCD driver structure
  * @retval OTG Core status
  */
usb_core_status_t USB_OTG_PCD_InitDriver(usb_core_pcd_driver_t *p_driver)
{
  p_driver->core_init = USB_OTG_InitCore;
  p_driver->core_deinit = USB_OTG_DeInitCore;
  p_driver->core_set_mode = USB_OTG_SetCurrentMode;
  p_driver->core_get_mode = USB_OTG_GetCurrentMode;
  p_driver->core_enable_interrupts = USB_OTG_EnableGlobalInterrupt;
  p_driver->core_disable_interrupts = USB_OTG_DisableGlobalInterrupt;
  p_driver->device_init = USB_OTG_InitDevice;
  p_driver->device_start = USB_OTG_StartDevice;
  p_driver->device_stop = USB_OTG_StopDevice;
  p_driver->device_connect = USB_OTG_ConnectDevice;
  p_driver->device_disconnect = USB_OTG_DisconnectDevice;
  p_driver->device_set_address = USB_OTG_SetDeviceAddress;
  p_driver->device_get_speed = USB_OTG_GetDeviceSpeed;
  p_driver->ep_activate = USB_OTG_ActivateEndpoint;
  p_driver->ep_deactivate = USB_OTG_DeactivateEndpoint;
  p_driver->ep_start_transfer = USB_OTG_StartEndpointXfer;
  p_driver->ep_stop_transfer = USB_OTG_StopEndpointXfer;
  p_driver->ep_set_stall = USB_OTG_SetEndpointStall;
  p_driver->ep_clear_stall = USB_OTG_ClearEndpointStall;
  p_driver->ep0_out_start = USB_OTG_StartOutEP0;
  p_driver->set_tx_fifo = USB_OTG_SetTxFiFoSize;
  p_driver->set_rx_fifo = USB_OTG_SetRxFiFoSize;
  p_driver->flush_tx_fifo = USB_OTG_FlushTxFifo;
  p_driver->flush_rx_fifo = USB_OTG_FlushRxFifo;
  p_driver->read_packet = USB_OTG_ReadPacket;
  p_driver->write_packet = USB_OTG_WritePacket;
  p_driver->remote_wakeup_activate = USB_OTG_ActivateRemoteWakeup;
  p_driver->remote_wakeup_deactivate = USB_OTG_DeActivateRemoteWakeup;

  p_driver->lpm_activate = USB_OTG_LPM_Activate;
  p_driver->lpm_deactivate = USB_OTG_LPM_DeActivate;

