STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_usb_otg_core.c
  p_driver->bcd_activate = USB_OTG_BCD_Activate;
  p_driver->bcd_deactivate = USB_OTG_BCD_DeActivate;
  p_driver->bcd_set_mode = USB_OTG_BCD_SetMode;
  p_driver->bcd_detect_port_type = USB_OTG_BCD_PortTypeDetection;

  return USB_CORE_OK;
}

/**
  * @brief  Initializes the USB_OTG controller registers
  *         for device mode
  * @param  instance  Selected device
  * @param  p_core_config USB Instance configuration parameters
  * @retval OTG Core status
  */
usb_core_status_t USB_OTG_InitDevice(uint32_t instance, const usb_core_config_params_t *p_core_config)
{
  usb_otg_global_t *p_usb = USB_OTG_GET_INSTANCE(instance);
  usb_core_status_t ret = USB_CORE_OK;
  uint32_t ep_idx;

  for (ep_idx = 0U; ep_idx < 15U; ep_idx++)
  {
    p_usb->DIEPTXF[ep_idx] = 0U;
  }

#if defined (USB_OTG_HS)
  /* Disable USB PHY pulldown resistors */
  p_usb->GCCFG &= ~USB_OTG_GCCFG_PULLDOWNEN;
#endif /* defined (USB_OTG_HS) */

  /* VBUS Sensing setup */
  if (p_core_config->vbus_sense_state == USB_CORE_CONFIG_DISABLED)
  {
    USB_OTG_DEVICE(instance)->DCTL |= USB_OTG_DCTL_SDIS;

    /* Deactivate VBUS Sensing B */
    p_usb->GCCFG &= ~USB_OTG_GCCFG_VBDEN;

    /* B-peripheral session valid override enable */
#if defined (USB_OTG_HS)
    p_usb->GCCFG |= USB_OTG_GCCFG_VBVALEXTOEN;
    p_usb->GCCFG |= USB_OTG_GCCFG_VBVALOVAL;
#else
    p_usb->GOTGCTL |= USB_OTG_GOTGCTL_BVALOEN;
    p_usb->GOTGCTL |= USB_OTG_GOTGCTL_BVALOVAL;
#endif /* defined (USB_OTG_HS) */
  }
  else
  {
#if defined (USB_OTG_HS)
    /* B-peripheral session valid override disable */
    p_usb->GCCFG &= ~USB_OTG_GCCFG_VBVALEXTOEN;
    p_usb->GCCFG &= ~USB_OTG_GCCFG_VBVALOVAL;
#endif /* defined (USB_OTG_HS) */

    /* Enable HW VBUS sensing */
    p_usb->GCCFG |= USB_OTG_GCCFG_VBDEN;
  }

  /* Restart the Phy Clock */
  USB_OTG_PCGCCTL(instance) = 0U;

#if defined (USB_OTG_HS)
  if (p_core_config->phy_interface == USB_CORE_PHY_EMBEDDED_HS)
  {
    if (p_core_config->core_speed == USB_CORE_SPEED_HS)
    {
      /* Set Core speed to High speed mode */
      (void)USB_OTG_SetDeviceSpeed(instance, USB_OTG_SPEED_HIGH);
    }
    else
    {
      /* Set Core speed to Full speed mode */
      (void)USB_OTG_SetDeviceSpeed(instance, USB_OTG_SPEED_HIGH_IN_FULL);
    }
  }
  else
#endif /* defined (USB_OTG_HS) */
  {
    /* Set Core speed to Full speed mode */
    (void)USB_OTG_SetDeviceSpeed(instance, USB_OTG_SPEED_FULL);
  }

  /* Flush the FIFOs */
  if (USB_OTG_FlushTxFifo(instance, 0x10U) != USB_CORE_OK) /* all Tx FIFOs */
  {
    ret = USB_CORE_ERROR;
  }

  if (USB_OTG_FlushRxFifo(instance) != USB_CORE_OK)
  {
    ret = USB_CORE_ERROR;
  }

  /* Clear all pending Device Interrupts */
  USB_OTG_DEVICE(instance)->DIEPMSK = 0U;
  USB_OTG_DEVICE(instance)->DOEPMSK = 0U;
  USB_OTG_DEVICE(instance)->DAINTMSK = 0U;

  for (ep_idx = 0U; ep_idx < p_core_config->endpoints_nbr; ep_idx++)
  {
    if ((USB_OTG_IN_EP(instance, ep_idx)->DIEPCTL & USB_OTG_DIEPCTL_EPENA) == USB_OTG_DIEPCTL_EPENA)
    {
      if (ep_idx == 0U)
      {
        USB_OTG_IN_EP(instance, ep_idx)->DIEPCTL = USB_OTG_DIEPCTL_SNAK;
      }
      else
      {
        USB_OTG_IN_EP(instance, ep_idx)->DIEPCTL = USB_OTG_DIEPCTL_EPDIS | USB_OTG_DIEPCTL_SNAK;
      }
    }
    else
    {
      USB_OTG_IN_EP(instance, ep_idx)->DIEPCTL = 0U;
    }

    USB_OTG_IN_EP(instance, ep_idx)->DIEPTSIZ = 0U;
    USB_OTG_IN_EP(instance, ep_idx)->DIEPINT  = 0xFB7FU;
  }

  for (ep_idx = 0U; ep_idx < p_core_config->endpoints_nbr; ep_idx++)
  {
    if ((USB_OTG_OUT_EP(instance, ep_idx)->DOEPCTL & USB_OTG_DOEPCTL_EPENA) == USB_OTG_DOEPCTL_EPENA)
    {
      if (ep_idx == 0U)
      {
        USB_OTG_OUT_EP(instance, ep_idx)->DOEPCTL = USB_OTG_DOEPCTL_SNAK;
      }
      else
      {
        USB_OTG_OUT_EP(instance, ep_idx)->DOEPCTL = USB_OTG_DOEPCTL_EPDIS | USB_OTG_DOEPCTL_SNAK;
      }
    }
    else
    {
      USB_OTG_OUT_EP(instance, ep_idx)->DOEPCTL = 0U;
    }

    USB_OTG_OUT_EP(instance, ep_idx)->DOEPTSIZ = 0U;
    USB_OTG_OUT_EP(instance, ep_idx)->DOEPINT  = 0xFB7FU;
  }

  USB_OTG_DEVICE(instance)->DIEPMSK &= ~(USB_OTG_DIEPMSK_TXFURM);

  /* Disable all interrupts. */
  p_usb->GINTMSK = 0U;

  /* Clear any pending interrupts */
  p_usb->GINTSTS = 0xBFFFFFFFU;

  /* Enable the common interrupts */
  if (p_core_config->dma_state == USB_CORE_CONFIG_DISABLED)
  {
    p_usb->GINTMSK |= USB_OTG_GINTMSK_RXFLVLM;
  }

  /* Enable interrupts matching to the Device mode ONLY */
  p_usb->GINTMSK |= USB_OTG_GINTMSK_USBSUSPM | USB_OTG_GINTMSK_USBRST |
                    USB_OTG_GINTMSK_ENUMDNEM | USB_OTG_GINTMSK_IEPINT |
                    USB_OTG_GINTMSK_OEPINT   | USB_OTG_GINTMSK_IISOIXFRM |
                    USB_OTG_GINTMSK_PXFRM_IISOOXFRM | USB_OTG_GINTMSK_WUIM;

  if (p_core_config->sof_state == USB_CORE_CONFIG_ENABLED)
  {
    p_usb->GINTMSK |= USB_OTG_GINTMSK_SOFM;
  }

  if (p_core_config->vbus_sense_state == USB_CORE_CONFIG_ENABLED)
  {
    p_usb->GINTMSK |= (USB_OTG_GINTMSK_SRQIM | USB_OTG_GINTMSK_OTGINT);
  }

  return ret;
}

/**
  * @brief  Initializes the DevSpd field of DCFG register
  *         depending the PHY type and the enumeration speed of the device.
  * @param  instance  Selected device
  * @param  speed  device speed
  *          This parameter can be one of these values:
  *            @arg USB_OTG_SPEED_HIGH: High speed mode
  *            @arg USB_OTG_SPEED_HIGH_IN_FULL: High speed core in Full Speed mode
  *            @arg USB_OTG_SPEED_FULL: Full speed mode
  * @retval  OTG Core status
  */
usb_core_status_t USB_OTG_SetDeviceSpeed(uint32_t instance, uint8_t speed)
{
  USB_OTG_DEVICE(instance)->DCFG |= speed;

  return USB_CORE_OK;
}

/**
  * @brief  Return the Dev Speed
  * @param  instance  Selected device
  * @retval device_speed  device speed
  *          This parameter can be one of these values:
  *          @arg USB_CORE_DEVICE_SPEED_HS: High speed mode
  *          @arg USB_CORE_DEVICE_SPEED_FS: Full speed mode
  */
usb_core_device_speed_t USB_OTG_GetDeviceSpeed(uint32_t instance)
{
  usb_core_device_speed_t device_speed;
  uint32_t dev_enum_speed = USB_OTG_DEVICE(instance)->DSTS & USB_OTG_DSTS_ENUMSPD;

  if (dev_enum_speed == USB_OTG_DSTS_ENUMSPD_HS_PHY_30MHZ_OR_60MHZ)
  {
    device_speed = USB_CORE_DEVICE_SPEED_HS;
  }
  else if ((dev_enum_speed == USB_OTG_DSTS_ENUMSPD_FS_PHY_30MHZ_OR_60MHZ)
           || (dev_enum_speed == USB_OTG_DSTS_ENUMSPD_FS_PHY_48MHZ))
  {
    device_speed = USB_CORE_DEVICE_SPEED_FS;
  }
  else
  {
    device_speed = USB_CORE_DEVICE_SPEED_ERROR;
  }

  return device_speed;
}

/**
  * @brief  USB_ReadDevAllOutEpInterrupt: return the USB device OUT endpoints interrupt status
  * @param  instance  Selected device
  * @retval USB Device OUT EP interrupt status
  */
uint32_t USB_OTG_ReadDevAllOutEpInterrupt(uint32_t instance)
{
  uint32_t daint_reg;

