STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_usb_otg_core.c
  daint_reg  = USB_OTG_DEVICE(instance)->DAINT;
  daint_reg &= USB_OTG_DEVICE(instance)->DAINTMSK;

  return ((daint_reg & 0xffff0000U) >> 16);
}

/**
  * @brief  USB_ReadDevAllInEpInterrupt: return the USB device IN endpoints interrupt status
  * @param  instance  Selected device
  * @retval USB Device IN EP interrupt status
  */
uint32_t USB_OTG_ReadDevAllInEpInterrupt(uint32_t instance)
{
  uint32_t daint_reg;

  daint_reg  = USB_OTG_DEVICE(instance)->DAINT;
  daint_reg &= USB_OTG_DEVICE(instance)->DAINTMSK;

  return ((daint_reg & 0xFFFFU));
}

/**
  * @brief  Returns Device OUT EP Interrupt register
  * @param  instance  Selected device
  * @param  ep_num  endpoint number
  *          This parameter can be a value from 0 to 15
  * @retval Device OUT EP Interrupt register
  */
uint32_t USB_OTG_ReadDevOutEPInterrupt(uint32_t instance, uint8_t ep_num)
{
  uint32_t doepint_reg;

  doepint_reg  = USB_OTG_OUT_EP(instance, ep_num)->DOEPINT;
  doepint_reg &= USB_OTG_DEVICE(instance)->DOEPMSK;

  return doepint_reg;
}

/**
  * @brief  Returns Device IN EP Interrupt register
  * @param  instance  Selected device
  * @param  ep_num  endpoint number
  *          This parameter can be a value from 0 to 15
  * @retval Device IN EP Interrupt register
  */
uint32_t USB_OTG_ReadDevInEPInterrupt(uint32_t instance, uint8_t ep_num)
{
  uint32_t diepint_reg;
  uint32_t msk;
  uint32_t emp;

  msk = USB_OTG_DEVICE(instance)->DIEPMSK;
  emp = USB_OTG_DEVICE(instance)->DIEPEMPMSK;
  msk |= ((emp >> (ep_num & USB_OTG_EP_ADDR_MSK)) & 0x1U) << 7;
  diepint_reg = USB_OTG_IN_EP(instance, ep_num)->DIEPINT & msk;

  return diepint_reg;
}

/**
  * @brief  Set the USB turnaround time
  * @param  instance USB Instance
  * @param  hclk: AHB clock frequency
  * @param  device_speed USB device speed
  * @retval USB turnaround time In PHY Clocks number
  */
usb_core_status_t USB_OTG_SetTurnaroundTime(uint32_t instance, uint32_t hclk, usb_core_device_speed_t device_speed)
{
  usb_otg_global_t *p_usb = USB_OTG_GET_INSTANCE(instance);
  uint32_t usb_trd;

  /* The USBTRD is configured according to the tables below, depending on AHB frequency
  used by application. In the low AHB frequency range it is used to stretch enough the USB response
  time to IN tokens, the USB turnaround time, so to compensate for the longer AHB read access
  latency to the Data FIFO */
  if (device_speed == USB_CORE_DEVICE_SPEED_FS)
  {
    if ((hclk >= 14200000U) && (hclk < 15000000U))
    {
      /* hclk Clock Range between 14.2-15 MHz */
      usb_trd = 0xFU;
    }
    else if ((hclk >= 15000000U) && (hclk < 16000000U))
    {
      /* hclk Clock Range between 15-16 MHz */
      usb_trd = 0xEU;
    }
    else if ((hclk >= 16000000U) && (hclk < 17200000U))
    {
      /* hclk Clock Range between 16-17.2 MHz */
      usb_trd = 0xDU;
    }
    else if ((hclk >= 17200000U) && (hclk < 18500000U))
    {
      /* hclk Clock Range between 17.2-18.5 MHz */
      usb_trd = 0xCU;
    }
    else if ((hclk >= 18500000U) && (hclk < 20000000U))
    {
      /* hclk Clock Range between 18.5-20 MHz */
      usb_trd = 0xBU;
    }
    else if ((hclk >= 20000000U) && (hclk < 21800000U))
    {
      /* hclk Clock Range between 20-21.8 MHz */
      usb_trd = 0xAU;
    }
    else if ((hclk >= 21800000U) && (hclk < 24000000U))
    {
      /* hclk Clock Range between 21.8-24 MHz */
      usb_trd = 0x9U;
    }
    else if ((hclk >= 24000000U) && (hclk < 27700000U))
    {
      /* hclk Clock Range between 24-27.7 MHz */
      usb_trd = 0x8U;
    }
    else if ((hclk >= 27700000U) && (hclk < 32000000U))
    {
      /* hclk Clock Range between 27.7-32 MHz */
      usb_trd = 0x7U;
    }
    else /* if(hclk >= 32000000) */
    {
      /* hclk Clock Range between 32-200 MHz */
      usb_trd = 0x6U;
    }
  }
  else if (device_speed == USB_CORE_DEVICE_SPEED_HS)
  {
    usb_trd = USB_OTG_HS_TRDT_VALUE;
  }
  else
  {
    usb_trd = USB_OTG_DEFAULT_TRDT_VALUE;
  }

  p_usb->GUSBCFG &= ~USB_OTG_GUSBCFG_TRDT;
  p_usb->GUSBCFG |= (uint32_t)((usb_trd << 10) & USB_OTG_GUSBCFG_TRDT);

  return USB_CORE_OK;
}

/**
  * @brief  Activate and configure an endpoint
  * @param  instance  Selected device
  * @param  p_ep pointer to endpoint structure
  * @retval HAL OTG Core status
  */
usb_core_status_t USB_OTG_ActivateEndpoint(uint32_t instance, usb_core_ep_t *p_ep)
{
  if (p_ep->dir == USB_CORE_EP_IN_DIR)
  {
    USB_OTG_DEVICE(instance)->DAINTMSK |= USB_OTG_DAINTMSK_IEPM & (uint32_t)(1UL << p_ep->num);

    if ((USB_OTG_IN_EP(instance, p_ep->num)->DIEPCTL & USB_OTG_DIEPCTL_USBAEP) == 0U)
    {
      USB_OTG_IN_EP(instance, p_ep->num)->DIEPCTL |= (p_ep->max_packet & USB_OTG_DIEPCTL_MPSIZ) |
                                                     ((uint32_t)p_ep->type << 18) | ((uint32_t)p_ep->num << 22) |
                                                     USB_OTG_DIEPCTL_SD0PID_SEVNFRM |
                                                     USB_OTG_DIEPCTL_USBAEP;
    }
  }
  else
  {
    USB_OTG_DEVICE(instance)->DAINTMSK |= USB_OTG_DAINTMSK_OEPM &
                                          ((uint32_t)(1UL << ((uint8_t)p_ep->num & USB_OTG_EP_ADDR_MSK)) << 16);

    if (((USB_OTG_OUT_EP(instance, p_ep->num)->DOEPCTL) & USB_OTG_DOEPCTL_USBAEP) == 0U)
    {
      USB_OTG_OUT_EP(instance, p_ep->num)->DOEPCTL |= (p_ep->max_packet & USB_OTG_DOEPCTL_MPSIZ) |
                                                      ((uint32_t)p_ep->type << 18) |
                                                      USB_OTG_DIEPCTL_SD0PID_SEVNFRM |
                                                      USB_OTG_DOEPCTL_USBAEP;
    }
  }
  return USB_CORE_OK;
}

/**
  * @brief  Activate and configure a dedicated endpoint
  * @param  instance  Selected device
  * @param  p_ep pointer to endpoint structure
  * @retval OTG Core status
  */
usb_core_status_t USB_OTG_ActivateDedicatedEndpoint(uint32_t instance, usb_core_ep_t *p_ep)
{
  if (p_ep->dir == USB_CORE_EP_IN_DIR)
  {
    if (((USB_OTG_IN_EP(instance, p_ep->num)->DIEPCTL) & USB_OTG_DIEPCTL_USBAEP) == 0U)
    {
      USB_OTG_IN_EP(instance, p_ep->num)->DIEPCTL |= (p_ep->max_packet & USB_OTG_DIEPCTL_MPSIZ) |
                                                     ((uint32_t)p_ep->type << 18) | ((uint32_t)p_ep->num << 22) |
                                                     USB_OTG_DIEPCTL_SD0PID_SEVNFRM |
                                                     USB_OTG_DIEPCTL_USBAEP;
    }

    USB_OTG_DEVICE(instance)->DEACHMSK |= USB_OTG_DAINTMSK_IEPM &
                                          (uint32_t)(1UL << ((uint8_t)p_ep->num & USB_OTG_EP_ADDR_MSK));
  }
  else
  {
    if (((USB_OTG_OUT_EP(instance, p_ep->num)->DOEPCTL) & USB_OTG_DOEPCTL_USBAEP) == 0U)
    {
      USB_OTG_OUT_EP(instance, p_ep->num)->DOEPCTL |= (p_ep->max_packet & USB_OTG_DOEPCTL_MPSIZ) |
                                                      ((uint32_t)p_ep->type << 18) | ((uint32_t)p_ep->num << 22) |
                                                      USB_OTG_DOEPCTL_USBAEP;
    }

    USB_OTG_DEVICE(instance)->DEACHMSK |= USB_OTG_DAINTMSK_OEPM &
                                          ((uint32_t)(1UL << ((uint8_t)p_ep->num & USB_OTG_EP_ADDR_MSK)) << 16);
  }

  return USB_CORE_OK;
}

/**
  * @brief  De-activate and de-initialize an endpoint
  * @param  instance  Selected device
  * @param  p_ep pointer to endpoint structure
  * @retval HAL OTG Core status
  */
usb_core_status_t USB_OTG_DeactivateEndpoint(uint32_t instance, const usb_core_ep_t *p_ep)
{
  if (p_ep->dir == USB_CORE_EP_IN_DIR)
  {
    if ((USB_OTG_IN_EP(instance, p_ep->num)->DIEPCTL & USB_OTG_DIEPCTL_EPENA) == USB_OTG_DIEPCTL_EPENA)
    {
      USB_OTG_IN_EP(instance, p_ep->num)->DIEPCTL |= USB_OTG_DIEPCTL_SNAK;
      USB_OTG_IN_EP(instance, p_ep->num)->DIEPCTL |= USB_OTG_DIEPCTL_EPDIS;
    }

    USB_OTG_DEVICE(instance)->DEACHMSK &= ~(USB_OTG_DAINTMSK_IEPM &
                                            (uint32_t)(1UL << ((uint8_t)p_ep->num & USB_OTG_EP_ADDR_MSK)));

