STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_usb_otg_core.c
    USB_OTG_DEVICE(instance)->DAINTMSK &= ~(USB_OTG_DAINTMSK_IEPM &
                                            (uint32_t)(1UL << ((uint8_t)p_ep->num & USB_OTG_EP_ADDR_MSK)));

    USB_OTG_IN_EP(instance, p_ep->num)->DIEPCTL &= ~(USB_OTG_DIEPCTL_USBAEP |
                                                     USB_OTG_DIEPCTL_MPSIZ |
                                                     USB_OTG_DIEPCTL_TXFNUM |
                                                     USB_OTG_DIEPCTL_SD0PID_SEVNFRM |
                                                     USB_OTG_DIEPCTL_EPTYP);
  }
  else
  {
    if ((USB_OTG_OUT_EP(instance, p_ep->num)->DOEPCTL & USB_OTG_DOEPCTL_EPENA) == USB_OTG_DOEPCTL_EPENA)
    {
      USB_OTG_OUT_EP(instance, p_ep->num)->DOEPCTL |= USB_OTG_DOEPCTL_SNAK;
      USB_OTG_OUT_EP(instance, p_ep->num)->DOEPCTL |= USB_OTG_DOEPCTL_EPDIS;
    }

    USB_OTG_DEVICE(instance)->DEACHMSK &= ~(USB_OTG_DAINTMSK_OEPM &
                                            ((uint32_t)(1UL << ((uint8_t)p_ep->num & USB_OTG_EP_ADDR_MSK)) << 16));

    USB_OTG_DEVICE(instance)->DAINTMSK &= ~(USB_OTG_DAINTMSK_OEPM &
                                            ((uint32_t)(1UL << ((uint8_t)p_ep->num & USB_OTG_EP_ADDR_MSK)) << 16));

    USB_OTG_OUT_EP(instance, p_ep->num)->DOEPCTL &= ~(USB_OTG_DOEPCTL_USBAEP |
                                                      USB_OTG_DOEPCTL_MPSIZ |
                                                      USB_OTG_DOEPCTL_SD0PID_SEVNFRM |
                                                      USB_OTG_DOEPCTL_EPTYP);
  }

  return USB_CORE_OK;
}

/**
  * @brief  De-activate and de-initialize a dedicated endpoint
  * @param  instance  Selected device
  * @param  p_ep pointer to endpoint structure
  * @retval OTG Core status
  */
usb_core_status_t USB_OTG_DeactivateDedicatedEndpoint(uint32_t instance, usb_core_ep_t *p_ep)
{
  if (p_ep->dir == USB_CORE_EP_IN_DIR)
  {
    if ((USB_OTG_IN_EP(instance, p_ep->num)->DIEPCTL & USB_OTG_DIEPCTL_EPENA) == USB_OTG_DIEPCTL_EPENA)
    {
      USB_OTG_IN_EP(instance, p_ep->num)->DIEPCTL |= USB_OTG_DIEPCTL_SNAK;
      USB_OTG_IN_EP(instance, p_ep->num)->DIEPCTL |= USB_OTG_DIEPCTL_EPDIS;
    }

    USB_OTG_IN_EP(instance, p_ep->num)->DIEPCTL &= ~USB_OTG_DIEPCTL_USBAEP;
    USB_OTG_DEVICE(instance)->DAINTMSK &= ~(USB_OTG_DAINTMSK_IEPM &
                                            (uint32_t)(1UL << ((uint8_t)p_ep->num & USB_OTG_EP_ADDR_MSK)));
  }
  else
  {
    if ((USB_OTG_OUT_EP(instance, p_ep->num)->DOEPCTL & USB_OTG_DOEPCTL_EPENA) == USB_OTG_DOEPCTL_EPENA)
    {
      USB_OTG_OUT_EP(instance, p_ep->num)->DOEPCTL |= USB_OTG_DOEPCTL_SNAK;
      USB_OTG_OUT_EP(instance, p_ep->num)->DOEPCTL |= USB_OTG_DOEPCTL_EPDIS;
    }

    USB_OTG_OUT_EP(instance, p_ep->num)->DOEPCTL &= ~USB_OTG_DOEPCTL_USBAEP;
    USB_OTG_DEVICE(instance)->DAINTMSK &= ~(USB_OTG_DAINTMSK_OEPM &
                                            ((uint32_t)(1UL << ((uint8_t)p_ep->num & USB_OTG_EP_ADDR_MSK)) << 16));
  }

  return USB_CORE_OK;
}

/**
  * @brief  Setup and starts a transfer over an EP
  * @param  instance  Selected device
  * @param  p_ep pointer to endpoint structure
  * @retval OTG Core status
  */
usb_core_status_t USB_OTG_StartEndpointXfer(uint32_t instance, usb_core_ep_t *p_ep)
{
  const usb_otg_global_t *p_usb = USB_OTG_GET_INSTANCE(instance);
  uint16_t packet_count;

  /* IN endpoint */
  if (p_ep->dir == USB_CORE_EP_IN_DIR)
  {
    /* Zero Length Packet? */
    if (p_ep->xfer_length == 0U)
    {
      USB_OTG_IN_EP(instance, p_ep->num)->DIEPTSIZ &= ~(USB_OTG_DIEPTSIZ_PKTCNT);
      USB_OTG_IN_EP(instance, p_ep->num)->DIEPTSIZ |= (USB_OTG_DIEPTSIZ_PKTCNT & (1U << 19));
      USB_OTG_IN_EP(instance, p_ep->num)->DIEPTSIZ &= ~(USB_OTG_DIEPTSIZ_XFRSIZ);
    }
    else
    {
      /* Program the transfer size and packet count
      * as follows: xfersize = N * maxpacket + short_packet
      *             pktcnt = N + (short_packet exist ? 1 : 0)
      */
      USB_OTG_IN_EP(instance, p_ep->num)->DIEPTSIZ &= ~(USB_OTG_DIEPTSIZ_XFRSIZ);
      USB_OTG_IN_EP(instance, p_ep->num)->DIEPTSIZ &= ~(USB_OTG_DIEPTSIZ_PKTCNT);

      if (p_ep->num == USB_CORE_ENDPOINT_0)
      {
        if (p_ep->xfer_length > p_ep->max_packet)
        {
          p_ep->xfer_length = p_ep->max_packet;
        }

        USB_OTG_IN_EP(instance, p_ep->num)->DIEPTSIZ |= (USB_OTG_DIEPTSIZ_PKTCNT & (1U << 19));
      }
      else
      {
        packet_count = (uint16_t)((p_ep->xfer_length + p_ep->max_packet - 1U) / p_ep->max_packet);
        USB_OTG_IN_EP(instance, p_ep->num)->DIEPTSIZ |= (USB_OTG_DIEPTSIZ_PKTCNT & ((uint32_t)packet_count << 19));

        if (p_ep->type == USB_CORE_EP_TYPE_ISOC)
        {
          USB_OTG_IN_EP(instance, p_ep->num)->DIEPTSIZ &= ~(USB_OTG_DIEPTSIZ_MULCNT);
          USB_OTG_IN_EP(instance, p_ep->num)->DIEPTSIZ |= (USB_OTG_DIEPTSIZ_MULCNT & ((uint32_t)packet_count << 29));
        }
      }

      USB_OTG_IN_EP(instance, p_ep->num)->DIEPTSIZ |= (USB_OTG_DIEPTSIZ_XFRSIZ & p_ep->xfer_length);
    }

    if ((p_usb->GAHBCFG & USB_OTG_GAHBCFG_DMAEN) == USB_OTG_GAHBCFG_DMAEN)
    {
      p_ep->dma_addr = (uint32_t)p_ep->p_xfer_buffer;

      if ((uint32_t)p_ep->dma_addr != 0U)
      {
        USB_OTG_IN_EP(instance, p_ep->num)->DIEPDMA = (uint32_t)(p_ep->dma_addr);
      }

      if (p_ep->type == USB_CORE_EP_TYPE_ISOC)
      {
        if ((USB_OTG_DEVICE(instance)->DSTS & (1U << 8)) == 0U)
        {
          USB_OTG_IN_EP(instance, p_ep->num)->DIEPCTL |= USB_OTG_DIEPCTL_SODDFRM;
        }
        else
        {
          USB_OTG_IN_EP(instance, p_ep->num)->DIEPCTL |= USB_OTG_DIEPCTL_SD0PID_SEVNFRM;
        }
      }

      /* EP enable, IN data in FIFO */
      USB_OTG_IN_EP(instance, p_ep->num)->DIEPCTL |= (USB_OTG_DIEPCTL_CNAK | USB_OTG_DIEPCTL_EPENA);
    }
    else
    {
      /* EP enable, IN data in FIFO */
      USB_OTG_IN_EP(instance, p_ep->num)->DIEPCTL |= (USB_OTG_DIEPCTL_CNAK | USB_OTG_DIEPCTL_EPENA);

      if (p_ep->type != USB_CORE_EP_TYPE_ISOC)
      {
        /* Enable the Tx FIFO Empty Interrupt for this EP */
        if (p_ep->xfer_length > 0U)
        {
          USB_OTG_DEVICE(instance)->DIEPEMPMSK |= 1UL << ((uint8_t)p_ep->num & USB_OTG_EP_ADDR_MSK);
        }
      }
      else
      {
        if ((USB_OTG_DEVICE(instance)->DSTS & (1U << 8)) == 0U)
        {
          USB_OTG_IN_EP(instance, p_ep->num)->DIEPCTL |= USB_OTG_DIEPCTL_SODDFRM;
        }
        else
        {
          USB_OTG_IN_EP(instance, p_ep->num)->DIEPCTL |= USB_OTG_DIEPCTL_SD0PID_SEVNFRM;
        }

        (void)USB_OTG_WritePacket(instance, p_ep->p_xfer_buffer, (uint8_t)p_ep->num, (uint16_t)p_ep->xfer_length);
      }
    }
  }
  else /* OUT endpoint */
  {
    /* Program the transfer size and packet count as follows:
    * pktcnt = N
    * xfersize = N * maxpacket
    */
    USB_OTG_OUT_EP(instance, p_ep->num)->DOEPTSIZ &= ~(USB_OTG_DOEPTSIZ_XFRSIZ);
    USB_OTG_OUT_EP(instance, p_ep->num)->DOEPTSIZ &= ~(USB_OTG_DOEPTSIZ_PKTCNT);

