STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_usb_otg_core.c
    if (p_ep->num == USB_CORE_ENDPOINT_0)
    {
      if (p_ep->xfer_length > 0U)
      {
        p_ep->xfer_length = p_ep->max_packet;
      }

      /* Store transfer size, for EP0 this is equal to endpoint max packet size */
      p_ep->xfer_size = p_ep->max_packet;

      USB_OTG_OUT_EP(instance, p_ep->num)->DOEPTSIZ |= (USB_OTG_DOEPTSIZ_XFRSIZ & p_ep->xfer_size);
      USB_OTG_OUT_EP(instance, p_ep->num)->DOEPTSIZ |= (USB_OTG_DOEPTSIZ_PKTCNT & (1U << 19));
    }
    else
    {
      if (p_ep->xfer_length == 0U)
      {
        USB_OTG_OUT_EP(instance, p_ep->num)->DOEPTSIZ |= (USB_OTG_DOEPTSIZ_XFRSIZ & p_ep->max_packet);
        USB_OTG_OUT_EP(instance, p_ep->num)->DOEPTSIZ |= (USB_OTG_DOEPTSIZ_PKTCNT & (1U << 19));
      }
      else
      {
        packet_count = (uint16_t)((p_ep->xfer_length + p_ep->max_packet - 1U) / p_ep->max_packet);
        p_ep->xfer_size = p_ep->max_packet * packet_count;

        USB_OTG_OUT_EP(instance, p_ep->num)->DOEPTSIZ |= USB_OTG_DOEPTSIZ_PKTCNT & ((uint32_t)packet_count << 19);
        USB_OTG_OUT_EP(instance, p_ep->num)->DOEPTSIZ |= USB_OTG_DOEPTSIZ_XFRSIZ & p_ep->xfer_size;
      }
    }

    if ((p_usb->GAHBCFG & USB_OTG_GAHBCFG_DMAEN) == USB_OTG_GAHBCFG_DMAEN)
    {
      p_ep->dma_addr = (uint32_t)p_ep->p_xfer_buffer;

      if ((uint32_t)p_ep->dma_addr != 0U)
      {
        USB_OTG_OUT_EP(instance, p_ep->num)->DOEPDMA = (uint32_t)(p_ep->dma_addr);
      }
    }

    if (p_ep->type == USB_CORE_EP_TYPE_ISOC)
    {
      if ((USB_OTG_DEVICE(instance)->DSTS & (1U << 8)) == 0U)
      {
        USB_OTG_OUT_EP(instance, p_ep->num)->DOEPCTL |= USB_OTG_DOEPCTL_SODDFRM;
      }
      else
      {
        USB_OTG_OUT_EP(instance, p_ep->num)->DOEPCTL |= USB_OTG_DOEPCTL_SD0PID_SEVNFRM;
      }
    }

    /* EP enable */
    USB_OTG_OUT_EP(instance, p_ep->num)->DOEPCTL |= (USB_OTG_DOEPCTL_CNAK | USB_OTG_DOEPCTL_EPENA);
  }

  return USB_CORE_OK;
}


/**
   * @brief  Stop transfer on an EP
   * @param  instance usb device instance
   * @param  p_ep pointer to endpoint structure
   * @retval HAL OTG Core status
   */
usb_core_status_t USB_OTG_StopEndpointXfer(uint32_t instance, const usb_core_ep_t *p_ep)
{
  __IO uint32_t count = 0U;
  usb_core_status_t ret = USB_CORE_OK;

  /* IN endpoint */
  if (p_ep->dir == USB_CORE_EP_IN_DIR)
  {
    /* EP enable, IN data in FIFO */
    if (((USB_OTG_IN_EP(instance, p_ep->num)->DIEPCTL) & USB_OTG_DIEPCTL_EPENA) == USB_OTG_DIEPCTL_EPENA)
    {
      USB_OTG_IN_EP(instance, p_ep->num)->DIEPCTL |= (USB_OTG_DIEPCTL_SNAK);
      USB_OTG_IN_EP(instance, p_ep->num)->DIEPCTL |= (USB_OTG_DIEPCTL_EPDIS);

      do
      {
        count++;

        if (count > 10000U)
        {
          ret = USB_CORE_ERROR;
          break;
        }
      } while (((USB_OTG_IN_EP(instance, p_ep->num)->DIEPCTL) & USB_OTG_DIEPCTL_EPENA) ==  USB_OTG_DIEPCTL_EPENA);
    }
  }
  else /* OUT endpoint */
  {
    if (((USB_OTG_OUT_EP(instance, p_ep->num)->DOEPCTL) & USB_OTG_DOEPCTL_EPENA) == USB_OTG_DOEPCTL_EPENA)
    {
      USB_OTG_OUT_EP(instance, p_ep->num)->DOEPCTL |= (USB_OTG_DOEPCTL_SNAK);
      USB_OTG_OUT_EP(instance, p_ep->num)->DOEPCTL |= (USB_OTG_DOEPCTL_EPDIS);

      do
      {
        count++;

        if (count > 10000U)
        {
          ret = USB_CORE_ERROR;
          break;
        }
      } while (((USB_OTG_OUT_EP(instance, p_ep->num)->DOEPCTL) & USB_OTG_DOEPCTL_EPENA) ==  USB_OTG_DOEPCTL_EPENA);
    }
  }

  return ret;
}

/**
  * @brief  Set a stall condition over an EP
  * @param  instance  Selected device
  * @param  p_ep pointer to endpoint structure
  * @retval OTG Core status
  */
usb_core_status_t USB_OTG_SetEndpointStall(uint32_t instance, const usb_core_ep_t *p_ep)
{
  if (p_ep->dir == USB_CORE_EP_IN_DIR)
  {
    if (((USB_OTG_IN_EP(instance, p_ep->num)->DIEPCTL & USB_OTG_DIEPCTL_EPENA) == 0U)
        && (p_ep->num != USB_CORE_ENDPOINT_0))
    {
      USB_OTG_IN_EP(instance, p_ep->num)->DIEPCTL &= ~(USB_OTG_DIEPCTL_EPDIS);
    }
    USB_OTG_IN_EP(instance, p_ep->num)->DIEPCTL |= USB_OTG_DIEPCTL_STALL;
  }
  else
  {
    if (((USB_OTG_OUT_EP(instance, p_ep->num)->DOEPCTL & USB_OTG_DOEPCTL_EPENA) == 0U)
        && (p_ep->num != USB_CORE_ENDPOINT_0))
    {
      USB_OTG_OUT_EP(instance, p_ep->num)->DOEPCTL &= ~(USB_OTG_DOEPCTL_EPDIS);
    }
    USB_OTG_OUT_EP(instance, p_ep->num)->DOEPCTL |= USB_OTG_DOEPCTL_STALL;
  }

  return USB_CORE_OK;
}

/**
  * @brief  Clear a stall condition over an EP
  * @param  instance  Selected device
  * @param  p_ep pointer to endpoint structure
  * @retval OTG Core status
  */
usb_core_status_t USB_OTG_ClearEndpointStall(uint32_t instance, const usb_core_ep_t *p_ep)
{
  if (p_ep->dir == USB_CORE_EP_IN_DIR)
  {
    USB_OTG_IN_EP(instance, p_ep->num)->DIEPCTL &= ~USB_OTG_DIEPCTL_STALL;
    if ((p_ep->type == USB_CORE_EP_TYPE_INTR) || (p_ep->type == USB_CORE_EP_TYPE_BULK))
    {
      USB_OTG_IN_EP(instance, p_ep->num)->DIEPCTL |= USB_OTG_DIEPCTL_SD0PID_SEVNFRM; /* DATA0 */
    }
  }
  else
  {
    USB_OTG_OUT_EP(instance, p_ep->num)->DOEPCTL &= ~USB_OTG_DOEPCTL_STALL;
    if ((p_ep->type == USB_CORE_EP_TYPE_INTR) || (p_ep->type == USB_CORE_EP_TYPE_BULK))
    {
      USB_OTG_OUT_EP(instance, p_ep->num)->DOEPCTL |= USB_OTG_DOEPCTL_SD0PID_SEVNFRM; /* DATA0 */
    }
  }
  return USB_CORE_OK;
}

/**
  * @brief  Start the USB device
  * @param  instance selected device
  * @retval OTG Core status
  */
usb_core_status_t USB_OTG_StartDevice(uint32_t instance)
{
  (void)USB_OTG_EnableGlobalInterrupt(instance);
  (void)USB_OTG_ConnectDevice(instance);

  return USB_CORE_OK;
}

/**
  * @brief  Stop the usb device mode
  * @param  instance  Selected device
  * @retval OTG Core status
  */
usb_core_status_t USB_OTG_StopDevice(uint32_t instance)
{
  usb_core_status_t ret;
  uint32_t ep_idx;

  /* Clear Pending interrupt */
  for (ep_idx = 0U; ep_idx < 15U; ep_idx++)
  {
    USB_OTG_IN_EP(instance, ep_idx)->DIEPINT = 0xFB7FU;
    USB_OTG_OUT_EP(instance, ep_idx)->DOEPINT = 0xFB7FU;
  }

  /* Clear interrupt masks */
  USB_OTG_DEVICE(instance)->DIEPMSK  = 0U;
  USB_OTG_DEVICE(instance)->DOEPMSK  = 0U;
  USB_OTG_DEVICE(instance)->DAINTMSK = 0U;


  /* Flush the RX FIFO */
  if (USB_OTG_FlushRxFifo(instance) != USB_CORE_OK)
  {
    ret = USB_CORE_ERROR;
  }
  /* Flush the TX FIFO */
  if (USB_OTG_FlushTxFifo(instance, 0x10U) != USB_CORE_OK)
  {
    ret = USB_CORE_ERROR;
  }

  return ret;
}

/**
  * @brief  Set USB device Address
  * @param  instance  Selected device
  * @param  address  new device address to be assigned
  *          This parameter can be a value from 0 to 255
  * @retval OTG Core status
  */
usb_core_status_t USB_OTG_SetDeviceAddress(uint32_t instance, uint8_t address)
{
  USB_OTG_DEVICE(instance)->DCFG &= ~(USB_OTG_DCFG_DAD);
  USB_OTG_DEVICE(instance)->DCFG |= ((uint32_t)address << 4) & USB_OTG_DCFG_DAD;

  return USB_CORE_OK;
}

/**
  * @brief  Connect the USB device by enabling Rpu
  * @param  instance  Selected device
  * @retval OTG Core status
  */
usb_core_status_t USB_OTG_ConnectDevice(uint32_t instance)
{
#if defined (STM32U575xx) || defined (STM32U585xx)
  usb_otg_global_t *p_usb = USB_OTG_GET_INSTANCE(instance);

  /* Enable USB Transceiver */
  p_usb->GCCFG |= USB_OTG_GCCFG_PWRDWN;
#endif /* defined (STM32U575xx) || defined (STM32U585xx) */

  /* In case phy is stopped, ensure to ungate and restore the phy CLK */
  USB_OTG_PCGCCTL(instance) &= ~(USB_OTG_PCGCCTL_STOPCLK | USB_OTG_PCGCCTL_GATECLK);

  USB_OTG_DEVICE(instance)->DCTL &= ~USB_OTG_DCTL_SDIS;

  return USB_CORE_OK;
}

/**
  * @brief  Disconnect the USB device by disabling Rpu
  * @param  instance  Selected device
  * @retval OTG Core status
  */
usb_core_status_t USB_OTG_DisconnectDevice(uint32_t instance)
{
  /* In case phy is stopped, ensure to ungate and restore the phy CLK */
  USB_OTG_PCGCCTL(instance) &= ~(USB_OTG_PCGCCTL_STOPCLK | USB_OTG_PCGCCTL_GATECLK);

  USB_OTG_DEVICE(instance)->DCTL |= USB_OTG_DCTL_SDIS;

#if defined (STM32U575xx) || defined (STM32U585xx)
  usb_otg_global_t *p_usb = USB_OTG_GET_INSTANCE(instance);

  /* Disable USB Transceiver */
  p_usb->GCCFG &= ~(USB_OTG_GCCFG_PWRDWN);
#endif /* defined (STM32U575xx) || defined (STM32U585xx) */

  return USB_CORE_OK;
}

/**
  * @brief  Activate EP0 for Setup transactions
  * @param  instance  Selected device
  * @retval OTG Core status
  */
usb_core_status_t USB_OTG_ActivateSetup(uint32_t instance)
{
  /* Set the MPS of the IN EP0 to 64 bytes */
  USB_OTG_IN_EP(instance, 0U)->DIEPCTL &= ~USB_OTG_DIEPCTL_MPSIZ;

  USB_OTG_DEVICE(instance)->DCTL |= USB_OTG_DCTL_CGINAK;

  return USB_CORE_OK;
}

/**
  * @brief  Prepare the EP0 to start the first control setup
  * @param  instance  Selected device
  * @param  p_setup  pointer to setup packet
  * @retval OTG Core status
  */
usb_core_status_t USB_OTG_StartOutEP0(uint32_t instance, const uint8_t *p_setup)
{
  const usb_otg_global_t *p_usb = USB_OTG_GET_INSTANCE(instance);
  uint32_t g_snps_id = *(__IO const uint32_t *)(&p_usb->GSNPSID);

  if (g_snps_id > USB_OTG_CORE_ID_300A)
  {
    if ((USB_OTG_OUT_EP(instance, 0U)->DOEPCTL & USB_OTG_DOEPCTL_EPENA) == USB_OTG_DOEPCTL_EPENA)
    {
      return USB_CORE_OK;
    }
  }

  USB_OTG_OUT_EP(instance, 0U)->DOEPTSIZ = 0U;
  USB_OTG_OUT_EP(instance, 0U)->DOEPTSIZ |= (USB_OTG_DOEPTSIZ_PKTCNT & (1U << 19));
  USB_OTG_OUT_EP(instance, 0U)->DOEPTSIZ |= (3U * 8U);
  USB_OTG_OUT_EP(instance, 0U)->DOEPTSIZ |=  USB_OTG_DOEPTSIZ_STUPCNT;

  if ((p_usb->GAHBCFG & USB_OTG_GAHBCFG_DMAEN) == USB_OTG_GAHBCFG_DMAEN)
  {
    USB_OTG_OUT_EP(instance, 0U)->DOEPDMA = (uint32_t)p_setup;
    /* EP enable */
    USB_OTG_OUT_EP(instance, 0U)->DOEPCTL |= USB_OTG_DOEPCTL_EPENA | USB_OTG_DOEPCTL_USBAEP;
  }

  return USB_CORE_OK;
}

/**
  * @brief  Activate LPM feature
  * @param  instance selected device
  * @retval OTG Core status
  */
usb_core_status_t USB_OTG_LPM_Activate(uint32_t instance)
{
  usb_otg_global_t *p_usb = USB_OTG_GET_INSTANCE(instance);

  p_usb->GINTMSK |= USB_OTG_GINTMSK_LPMINTM;
  p_usb->GLPMCFG |= (USB_OTG_GLPMCFG_LPMEN | USB_OTG_GLPMCFG_LPMACK | USB_OTG_GLPMCFG_ENBESL);

  return USB_CORE_OK;
}

/**
  * @brief  DeActivate LPM feature
  * @param  instance selected device
  * @retval OTG Core status
  */
usb_core_status_t USB_OTG_LPM_DeActivate(uint32_t instance)
{
  usb_otg_global_t *p_usb = USB_OTG_GET_INSTANCE(instance);

  p_usb->GINTMSK &= ~USB_OTG_GINTMSK_LPMINTM;
  p_usb->GLPMCFG &= ~(USB_OTG_GLPMCFG_LPMEN | USB_OTG_GLPMCFG_LPMACK | USB_OTG_GLPMCFG_ENBESL);

  return USB_CORE_OK;
}


/**
  * @}
  */


