STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_usb_otg_core.c
/** @defgroup USB_OTG_Core_Host_Exported_Functions USB Core Host Exported Functions
  * @{
  */


/**
  * @brief  Initialize the USB OTG HCD Driver
  * @param  p_driver pointer to USB HCD driver structure
  * @retval OTG Core status
  */
usb_core_status_t USB_OTG_HCD_InitDriver(usb_core_hcd_driver_t *p_driver)
{
  p_driver->core_init = USB_OTG_InitCore;
  p_driver->core_deinit = USB_OTG_DeInitCore;
  p_driver->core_set_mode = USB_OTG_SetCurrentMode;
  p_driver->core_get_mode = USB_OTG_GetCurrentMode;
  p_driver->core_enable_interrupts = USB_OTG_EnableGlobalInterrupt;
  p_driver->core_disable_interrupts = USB_OTG_DisableGlobalInterrupt;
  p_driver->core_get_dma_status = USB_OTG_GetDmaStatus;
  p_driver->host_init = USB_OTG_InitHost;
  p_driver->host_start = USB_OTG_StartHost;
  p_driver->host_stop = USB_OTG_StopHost;
  p_driver->host_channel_init = USB_OTG_InitChannel;
  p_driver->host_channel_start = USB_OTG_StartChannelXfer;
  p_driver->host_channel_halt = USB_OTG_HaltChannel;
  p_driver->host_port_power = USB_OTG_PortPower;
  p_driver->host_port_reset = USB_OTG_PortReset;
  p_driver->host_port_suspend = USB_OTG_PortSuspend;
  p_driver->host_port_resume = USB_OTG_PortResume;
  p_driver->host_get_port_speed = USB_OTG_GetHostPortSpeed;
  p_driver->host_get_current_frame = USB_OTG_GetCurrentFrame;

  return USB_CORE_OK;
}

/**
  * @brief  Initializes the USB OTG controller registers
  *         for Host mode
  * @param  instance  Selected device
  * @param  p_core_config USB Instance configuration parameters
  * @retval OTG Core status
  */
usb_core_status_t USB_OTG_InitHost(uint32_t instance, const usb_core_config_params_t *p_core_config)
{
  usb_core_status_t ret = USB_CORE_OK;
  usb_otg_global_t *p_usb = USB_OTG_GET_INSTANCE(instance);
  uint32_t ch_idx;

#if defined (USB_OTG_HS)
  /* Enable USB PHY pulldown resistors */
  p_usb->GCCFG |= USB_OTG_GCCFG_PULLDOWNEN;

  /* Disable VBUS override */
  p_usb->GCCFG &= ~(USB_OTG_GCCFG_VBVALOVAL | USB_OTG_GCCFG_VBVALEXTOEN);

#else

  /* Disable Battery chargin detector */
  p_usb->GCCFG &= ~(USB_OTG_GCCFG_BCDEN);
#endif /* defined (USB_OTG_HS) */

  /* Disable Battery chargin detector */
  p_usb->GCCFG &= ~(USB_OTG_GCCFG_PDEN);
  p_usb->GCCFG &= ~(USB_OTG_GCCFG_SDEN);

  /* Disable VBUS sensing */
  p_usb->GCCFG &= ~(USB_OTG_GCCFG_VBDEN);

  /* Restart the Phy Clock */
  USB_OTG_PCGCCTL(instance) = 0U;

  if ((p_usb->GUSBCFG & USB_OTG_GUSBCFG_PHYSEL) == 0U)
  {
    if (p_core_config->core_speed == USB_CORE_SPEED_HS_IN_FS)
    {
      /* Force Device Enumeration to FS/LS mode only */
      USB_OTG_HOST(instance)->HCFG |= USB_OTG_HCFG_FSLSS;
    }
    else
    {
      /* Set default Max speed support */
      USB_OTG_HOST(instance)->HCFG &= ~(USB_OTG_HCFG_FSLSS);
    }
  }
  else
  {
    /* Set default Max speed support */
    USB_OTG_HOST(instance)->HCFG &= ~(USB_OTG_HCFG_FSLSS);
  }

  /* Flush all TX FIFOs */
  if (USB_OTG_FlushTxFifo(instance, 0x10U) != USB_CORE_OK)
  {
    ret = USB_CORE_ERROR;
  }

  /* Flush the RX FIFO */
  if (USB_OTG_FlushRxFifo(instance) != USB_CORE_OK)
  {
    ret = USB_CORE_ERROR;
  }

  /* Clear all pending HC Interrupts */
  for (ch_idx = 0U; ch_idx < p_core_config->channels_nbr; ch_idx++)
  {
    USB_OTG_CHANNEL(instance, ch_idx)->HCINT = USB_OTG_CLEAR_INTERRUPT_MASK;
    USB_OTG_CHANNEL(instance, ch_idx)->HCINTMSK = 0U;
  }

  /* Disable all interrupts. */
  p_usb->GINTMSK = 0U;

  /* Clear any pending interrupts */
  p_usb->GINTSTS = USB_OTG_CLEAR_INTERRUPT_MASK;
#if defined (USB_OTG_HS)
  if (instance == (uint32_t)USB_OTG_HS)
  {
    /* Set Rx FIFO size */
    p_usb->GRXFSIZ  = 0x200U;
    p_usb->DIEPTXF0_HNPTXFSIZ = (uint32_t)(((0x100U << 16) & USB_OTG_NPTXFD) | 0x200U);
    p_usb->HPTXFSIZ = (uint32_t)(((0xE0U << 16) & USB_OTG_HPTXFSIZ_PTXFD) | 0x300U);
  }
  else
#endif /* defined (USB_OTG_HS) */
  {
    /* Set Rx FIFO size */
    p_usb->GRXFSIZ  = 0x80U;
    p_usb->DIEPTXF0_HNPTXFSIZ = (uint32_t)(((0x60U << 16) & USB_OTG_NPTXFD) | 0x80U);
    p_usb->HPTXFSIZ = (uint32_t)(((0x40U << 16)& USB_OTG_HPTXFSIZ_PTXFD) | 0xE0U);
  }

  /* Enable the common interrupts */
  if ((p_usb->GAHBCFG & USB_OTG_GAHBCFG_DMAEN) == 0U)
  {
    p_usb->GINTMSK |= USB_OTG_GINTMSK_RXFLVLM;
  }

  /* Enable interrupts matching to the Host mode ONLY */
  p_usb->GINTMSK |= (USB_OTG_GINTMSK_PRTIM            | USB_OTG_GINTMSK_HCIM | \
                     USB_OTG_GINTMSK_SOFM             | USB_OTG_GINTSTS_DISCINT | \
                     USB_OTG_GINTMSK_PXFRM_IISOOXFRM  | USB_OTG_GINTMSK_WUIM);

  return ret;
}

/**
  * @brief  Initializes the FSLSPClkSel field of the
  *         HCFG register on the PHY type and set the right frame interval
  * @param  instance  Selected device
  * @param  frequency  clock frequency
  *          This parameter can be one of these values:
  *           USB_OTG_HCFG_48_MHZ : Full Speed 48 MHz Clock
  *           USB_OTG_HCFG_6_MHZ : Low Speed 6 MHz Clock
  * @retval OTG Core status
  */
usb_core_status_t USB_OTG_InitFSLSPClkSel(uint32_t instance, uint8_t frequency)
{
  USB_OTG_HOST(instance)->HCFG &= ~(USB_OTG_HCFG_FSLSPCS);
  USB_OTG_HOST(instance)->HCFG |= (uint32_t)frequency & USB_OTG_HCFG_FSLSPCS;

  if (frequency == (uint8_t)USB_OTG_HCFG_48_MHZ)
  {
    USB_OTG_HOST(instance)->HFIR = (__IO uint32_t)USB_OTG_HFIR_48_MHZ;
  }
  else if (frequency == (uint8_t)USB_OTG_HCFG_6_MHZ)
  {
    USB_OTG_HOST(instance)->HFIR = (__IO uint32_t)USB_OTG_HFIR_6_MHZ;
  }
  else
  {
    return USB_CORE_ERROR;
  }

  return USB_CORE_OK;
}

/**
  * @brief  Initialize a host channel
  * @param  instance  Selected device
  * @param  p_ch pointer to host Channel configuration
  * @retval OTG Core status
  */
usb_core_status_t USB_OTG_InitChannel(uint32_t instance, usb_core_ch_t *p_ch)
{
  usb_core_status_t ret = USB_CORE_OK;
  usb_otg_global_t *p_usb = USB_OTG_GET_INSTANCE(instance);
  uint32_t hcchar_mps = p_ch->max_packet;
  uint32_t hcchar_ep_dir;
  uint32_t hcchar_low_speed;
  usb_core_port_speed_t host_port_speed;

  /* Clear old interrupt conditions for this host channel. */
  USB_OTG_CHANNEL(instance, p_ch->ch_num)->HCINT = USB_OTG_CLEAR_INTERRUPT_MASK;

  /* Enable channel interrupts required for this transfer. */
  switch (p_ch->ep_type)
  {
    case USB_CORE_EP_TYPE_CTRL:
    case USB_CORE_EP_TYPE_BULK:
      USB_OTG_CHANNEL(instance, p_ch->ch_num)->HCINTMSK = USB_OTG_HCINTMSK_XFRCM  |
                                                          USB_OTG_HCINTMSK_STALLM |
                                                          USB_OTG_HCINTMSK_TXERRM |
                                                          USB_OTG_HCINTMSK_DTERRM |
                                                          USB_OTG_HCINTMSK_AHBERR |
                                                          USB_OTG_HCINTMSK_NAKM;

