STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_usb_otg_core.c
      if (p_ch->ch_dir == USB_CORE_CH_IN_DIR)
      {
        USB_OTG_CHANNEL(instance, p_ch->ch_num)->HCINTMSK |= USB_OTG_HCINTMSK_BBERRM;
      }
      else
      {
#if defined (USB_OTG_HS)
        if (instance == (uint32_t)USB_OTG_HS)
        {
          USB_OTG_CHANNEL(instance, p_ch->ch_num)->HCINTMSK |= USB_OTG_HCINTMSK_NYET |
                                                               USB_OTG_HCINTMSK_ACKM;
        }
#endif /* defined (USB_OTG_HS) */
      }
      break;

    case USB_CORE_EP_TYPE_INTR:
      USB_OTG_CHANNEL(instance, p_ch->ch_num)->HCINTMSK = USB_OTG_HCINTMSK_XFRCM  |
                                                          USB_OTG_HCINTMSK_STALLM |
                                                          USB_OTG_HCINTMSK_TXERRM |
                                                          USB_OTG_HCINTMSK_DTERRM |
                                                          USB_OTG_HCINTMSK_NAKM   |
                                                          USB_OTG_HCINTMSK_AHBERR |
                                                          USB_OTG_HCINTMSK_FRMORM;

      if (p_ch->ch_dir == USB_CORE_CH_IN_DIR)
      {
        USB_OTG_CHANNEL(instance, p_ch->ch_num)->HCINTMSK |= USB_OTG_HCINTMSK_BBERRM;
      }

      break;

    case USB_CORE_EP_TYPE_ISOC:
      USB_OTG_CHANNEL(instance, p_ch->ch_num)->HCINTMSK = USB_OTG_HCINTMSK_XFRCM  |
                                                          USB_OTG_HCINTMSK_ACKM   |
                                                          USB_OTG_HCINTMSK_AHBERR |
                                                          USB_OTG_HCINTMSK_FRMORM;

      if (p_ch->ch_dir == USB_CORE_CH_IN_DIR)
      {
        USB_OTG_CHANNEL(instance, p_ch->ch_num)->HCINTMSK |= (USB_OTG_HCINTMSK_TXERRM | USB_OTG_HCINTMSK_BBERRM);
      }
      break;

    default:
      ret = USB_CORE_ERROR;
      break;
  }

  /* Clear Hub Start Split transaction */
  USB_OTG_CHANNEL(instance, p_ch->ch_num)->HCSPLT = 0U;

  /* Enable host channel Halt interrupt */
  USB_OTG_CHANNEL(instance, p_ch->ch_num)->HCINTMSK |= USB_OTG_HCINTMSK_CHHM;

  /* Enable the top level host channel interrupt. */
  USB_OTG_HOST(instance)->HAINTMSK |= 1UL << ((uint32_t)p_ch->ch_num & 0xFU);

  /* Make sure host channel interrupts are enabled. */
  p_usb->GINTMSK |= USB_OTG_GINTMSK_HCIM;

  /* Program the HCCHAR register */
  if (p_ch->ch_dir == USB_CORE_CH_IN_DIR)
  {
    hcchar_ep_dir = (0x1U << 15) & USB_OTG_HCCHAR_EPDIR;
  }
  else
  {
    hcchar_ep_dir = 0U;
  }

  host_port_speed = USB_OTG_GetHostPortSpeed(instance);

  /* LS device plugged to HUB */
  if ((p_ch->speed == USB_CORE_DEVICE_SPEED_LS) && (host_port_speed != USB_CORE_PORT_SPEED_LS))
  {
    hcchar_low_speed = (0x1U << 17) & USB_OTG_HCCHAR_LSDEV;
  }
  else
  {
    hcchar_low_speed = 0U;
  }

  if (p_ch->ep_type == USB_CORE_EP_TYPE_ISOC)
  {
    /* FS device plugged to HS HUB */
    if ((p_ch->speed == USB_CORE_DEVICE_SPEED_FS) && (host_port_speed == USB_CORE_PORT_SPEED_HS))
    {
      if (hcchar_mps > USB_OTG_ISO_SPLT_MPS)
      {
        /* ISO Max Packet Size for Split mode */
        hcchar_mps = USB_OTG_ISO_SPLT_MPS;
      }
    }
  }

  p_ch->max_packet = (uint16_t)hcchar_mps;

  USB_OTG_CHANNEL(instance, p_ch->ch_num)->HCCHAR = (((uint32_t)p_ch->dev_addr << 22) & USB_OTG_HCCHAR_DAD) |
                                                    (((uint32_t)p_ch->ep_num << 11) & USB_OTG_HCCHAR_EPNUM) |
                                                    (((uint32_t)p_ch->ep_type << 18) & USB_OTG_HCCHAR_EPTYP) |
                                                    (hcchar_mps & USB_OTG_HCCHAR_MPSIZ) |
                                                    USB_OTG_HCCHAR_MC_0 | hcchar_ep_dir | hcchar_low_speed;

  if ((p_ch->ep_type == USB_CORE_EP_TYPE_INTR) || (p_ch->ep_type == USB_CORE_EP_TYPE_ISOC))
  {
    USB_OTG_CHANNEL(instance, p_ch->ch_num)->HCCHAR |= USB_OTG_HCCHAR_ODDFRM;
  }

  return ret;
}

/**
  * @brief  Start a transfer over a host channel
  * @param  instance  Selected device
  * @param  p_ch pointer to host Channel configuration
  * @retval OTG Core status
  */
usb_core_status_t USB_OTG_StartChannelXfer(uint32_t instance, usb_core_ch_t *p_ch)
{
  usb_otg_global_t *p_usb = USB_OTG_GET_INSTANCE(instance);
  uint32_t dma_enable = (p_usb->GAHBCFG & USB_OTG_GAHBCFG_DMAEN) >> 0x5U;
  uint16_t max_hc_pkt_count = USB_OTG_CH_MAX_PKT_CNT;
  __IO uint32_t hcchar_reg;
  uint8_t  is_odd_frame;
  uint16_t len_words;
  uint16_t num_packets;

  /* Reset channel transfer size */
  p_ch->xfer_size = 0U;

#if defined (USB_OTG_HS)
  if (instance == (uint32_t)USB_OTG_HS)
  {
    /* In DMA mode host Core automatically issues ping in case of NYET/NAK */
    if (dma_enable == 1U)
    {
      if (((p_ch->ep_type == USB_CORE_EP_TYPE_CTRL)
           || (p_ch->ep_type == USB_CORE_EP_TYPE_BULK)) && (p_ch->do_ssplit == 0U))
      {
        USB_OTG_CHANNEL(instance, p_ch->ch_num)->HCINTMSK &= ~(USB_OTG_HCINTMSK_NYET |
                                                               USB_OTG_HCINTMSK_ACKM |
                                                               USB_OTG_HCINTMSK_NAKM);
      }
    }
    else
    {
      if ((p_ch->speed == USB_CORE_DEVICE_SPEED_HS) && (p_ch->do_ping == 1U))
      {
        (void)USB_OTG_DoPing(instance, p_ch->ch_num);
        return USB_CORE_OK;
      }
    }
  }
#endif /* defined (USB_OTG_HS) */

  if (p_ch->do_ssplit == 1U)
  {
    /* Set number of packet to 1 for Split transaction */
    num_packets = 1U;

    if (p_ch->ch_dir == USB_CORE_CH_IN_DIR)
    {
      p_ch->xfer_size = (uint32_t)num_packets * p_ch->max_packet;
    }
    else
    {
      if (p_ch->ep_type == USB_CORE_EP_TYPE_ISOC)
      {
        if (p_ch->xfer_length > USB_OTG_ISO_SPLT_MPS)
        {
          /* Isochrone Max Packet Size for Split mode */
          p_ch->xfer_size = p_ch->max_packet;
          p_ch->xfer_length = p_ch->xfer_size;

          if ((p_ch->iso_split_xact_pos == (uint8_t)USB_OTG_HCSPLT_BEGIN)
              || (p_ch->iso_split_xact_pos == (uint8_t)USB_OTG_HCSPLT_MIDDLE))
          {
            p_ch->iso_split_xact_pos = (uint8_t)USB_OTG_HCSPLT_MIDDLE;
          }
          else
          {
            p_ch->iso_split_xact_pos = (uint8_t)USB_OTG_HCSPLT_BEGIN;
          }
        }
        else
        {
          p_ch->xfer_size = p_ch->xfer_length;

          if ((p_ch->iso_split_xact_pos != (uint8_t)USB_OTG_HCSPLT_BEGIN)
              && (p_ch->iso_split_xact_pos != (uint8_t)USB_OTG_HCSPLT_MIDDLE))
          {
            p_ch->iso_split_xact_pos = (uint8_t)USB_OTG_HCSPLT_FULL;
          }
          else
          {
            p_ch->iso_split_xact_pos = (uint8_t)USB_OTG_HCSPLT_END;
          }
        }
      }
      else
      {
        if ((dma_enable == 1U) && (p_ch->xfer_length > p_ch->max_packet))
        {
          p_ch->xfer_size = (uint32_t)num_packets * p_ch->max_packet;
        }
        else
        {
          p_ch->xfer_size = p_ch->xfer_length;
        }
      }
    }
  }
  else
  {
    /* Compute the expected number of packets associated to the transfer */
    if (p_ch->xfer_length > 0U)
    {
      num_packets = (uint16_t)((p_ch->xfer_length + p_ch->max_packet - 1U) / p_ch->max_packet);

      if (num_packets > max_hc_pkt_count)
      {
        num_packets = max_hc_pkt_count;
        p_ch->xfer_size = (uint32_t)num_packets * p_ch->max_packet;
      }
      else
      {
        /*
        * For IN channel HCTSIZ.xfer_size is expected to be an integer multiple of
        * max_packet size.
        */
        if (p_ch->ch_dir == USB_CORE_CH_IN_DIR)
        {
          p_ch->xfer_size = (uint32_t)num_packets * p_ch->max_packet;
        }
        else
        {
          p_ch->xfer_size = p_ch->xfer_length;
        }
      }
    }
    else
    {
      num_packets = 1U;
      /*
      * For IN channel HCTSIZ.xfer_size is expected to be an integer multiple of
      * max_packet size.
      */
      if (p_ch->ch_dir == USB_CORE_CH_IN_DIR)
      {
        p_ch->xfer_size = (uint32_t)num_packets * p_ch->max_packet;
      }
      else
      {
        p_ch->xfer_size = p_ch->xfer_length;
      }
    }
  }

  /* Initialize the HCTSIZn register */
  USB_OTG_CHANNEL(instance, p_ch->ch_num)->HCTSIZ = (p_ch->xfer_size & USB_OTG_HCTSIZ_XFRSIZ) |
                                                    (((uint32_t)num_packets << 19) & USB_OTG_HCTSIZ_PKTCNT) |
                                                    (((uint32_t)p_ch->data_pid << 29) & USB_OTG_HCTSIZ_DPID);

