STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_usb_otg_core.c
  if (dma_enable == 1U)
  {
    /* p_xfer_buffer MUST be 32-bits aligned */
    USB_OTG_CHANNEL(instance, p_ch->ch_num)->HCDMA = (uint32_t)p_ch->p_xfer_buffer;
  }

  is_odd_frame = (((uint32_t)USB_OTG_HOST(instance)->HFNUM & 0x01U) != 0U) ? 0U : 1U;
  USB_OTG_CHANNEL(instance, p_ch->ch_num)->HCCHAR &= ~USB_OTG_HCCHAR_ODDFRM;
  USB_OTG_CHANNEL(instance, p_ch->ch_num)->HCCHAR |= (uint32_t)is_odd_frame << 29;

  if (p_ch->do_ssplit == 1U)
  {
    /* Set Hub start Split transaction */
    USB_OTG_CHANNEL(instance, p_ch->ch_num)->HCSPLT = ((uint32_t)p_ch->hub_addr << USB_OTG_HCSPLT_HUBADDR_Pos) |
                                                      (uint32_t)p_ch->hub_port_nbr | USB_OTG_HCSPLT_SPLITEN;

    /* Unmask ack & nyet for IN/OUT transactions */
    USB_OTG_CHANNEL(instance, p_ch->ch_num)->HCINTMSK |= (USB_OTG_HCINTMSK_ACKM |
                                                          USB_OTG_HCINTMSK_NYET);

    if ((p_ch->do_csplit == 1U) && (p_ch->ch_dir == USB_CORE_CH_OUT_DIR))
    {
      USB_OTG_CHANNEL(instance, p_ch->ch_num)->HCSPLT |= USB_OTG_HCSPLT_COMPLSPLT;
      USB_OTG_CHANNEL(instance, p_ch->ch_num)->HCINTMSK |= USB_OTG_HCINTMSK_NYET;
    }

    if (((p_ch->ep_type == USB_CORE_EP_TYPE_ISOC) || (p_ch->ep_type == USB_CORE_EP_TYPE_INTR))
        && (p_ch->do_csplit == 1U) && (p_ch->ch_dir == USB_CORE_CH_IN_DIR))
    {
      USB_OTG_CHANNEL(instance, p_ch->ch_num)->HCSPLT |= USB_OTG_HCSPLT_COMPLSPLT;
    }

    /* Position management for iso out transaction on split mode */
    if ((p_ch->ep_type == USB_CORE_EP_TYPE_ISOC) && (p_ch->ch_dir == USB_CORE_CH_OUT_DIR))
    {
      if (p_ch->iso_split_xact_pos == USB_OTG_HCSPLT_BEGIN)
      {
        USB_OTG_CHANNEL(instance, p_ch->ch_num)->HCSPLT |= USB_OTG_HCSPLT_XACTPOS_1;
      }
      else if (p_ch->iso_split_xact_pos == USB_OTG_HCSPLT_MIDDLE)
      {
        USB_OTG_CHANNEL(instance, p_ch->ch_num)->HCSPLT |= USB_OTG_HCSPLT_XACTPOS_Pos;
      }
      else if (p_ch->iso_split_xact_pos == USB_OTG_HCSPLT_END)
      {
        USB_OTG_CHANNEL(instance, p_ch->ch_num)->HCSPLT |= USB_OTG_HCSPLT_XACTPOS_0;
      }
      else if (p_ch->iso_split_xact_pos == USB_OTG_HCSPLT_FULL)
      {
        USB_OTG_CHANNEL(instance, p_ch->ch_num)->HCSPLT |= USB_OTG_HCSPLT_XACTPOS;
      }
      else
      {
        /* .. */
      }
    }
  }
  else
  {
    /* Clear Hub Start Split transaction */
    USB_OTG_CHANNEL(instance, p_ch->ch_num)->HCSPLT = 0U;
  }

  /* Set host channel enable */
  hcchar_reg = USB_OTG_CHANNEL(instance, p_ch->ch_num)->HCCHAR;
  hcchar_reg &= ~USB_OTG_HCCHAR_CHDIS;

  /* Make sure to set the correct ep direction */
  if (p_ch->ch_dir == USB_CORE_CH_IN_DIR)
  {
    hcchar_reg |= USB_OTG_HCCHAR_EPDIR;
  }
  else
  {
    hcchar_reg &= ~USB_OTG_HCCHAR_EPDIR;
  }
  hcchar_reg |= USB_OTG_HCCHAR_CHENA;
  USB_OTG_CHANNEL(instance, p_ch->ch_num)->HCCHAR = hcchar_reg;

  if (dma_enable == 1U) /* dma mode */
  {
    return USB_CORE_OK;
  }

  if ((p_ch->ch_dir == USB_CORE_CH_OUT_DIR) && (p_ch->xfer_length > 0U) && (p_ch->do_csplit == 0U))
  {
    switch (p_ch->ep_type)
    {
      /* Non periodic transfer */
      case USB_CORE_EP_TYPE_CTRL:
      case USB_CORE_EP_TYPE_BULK:

        len_words = (uint16_t)((p_ch->xfer_length + 3U) / 4U);

        /* Check if there is enough space in FIFO space */
        if (len_words > (p_usb->HNPTXSTS & 0xFFFFU))
        {
          /* Need to process data in nptxfempty interrupt */
          p_usb->GINTMSK |= USB_OTG_GINTMSK_NPTXFEM;
        }
        break;

      /* Periodic transfer */
      case USB_CORE_EP_TYPE_INTR:
      case USB_CORE_EP_TYPE_ISOC:

        len_words = (uint16_t)((p_ch->xfer_length + 3U) / 4U);
        /* Check if there is enough space in FIFO space */
        if (len_words > (USB_OTG_HOST(instance)->HPTXSTS & 0xFFFFU)) /* split the transfer */
        {
          /* Need to process data in ptxfempty interrupt */
          p_usb->GINTMSK |= USB_OTG_GINTMSK_PTXFEM;
        }
        break;

      default:
        return USB_CORE_ERROR;
        break;
    }

    /* Write packet into the Tx FIFO. */
    (void)USB_OTG_WritePacket(instance, p_ch->p_xfer_buffer, (uint8_t)p_ch->ch_num, (uint16_t)p_ch->xfer_length);
  }

  return USB_CORE_OK;
}

/**
  * @brief  Halt a host channel
  * @param  instance  Selected device
  * @param  p_ch pointer to host Channel configuration
  * @retval OTG Core status
  */
usb_core_status_t USB_OTG_HaltChannel(uint32_t instance, const usb_core_ch_t *p_ch)
{
  const usb_otg_global_t *p_usb = USB_OTG_GET_INSTANCE(instance);
  uint32_t hcchar_ep_type = (USB_OTG_CHANNEL(instance, p_ch->ch_num)->HCCHAR & USB_OTG_HCCHAR_EPTYP) >> 18;
  usb_core_ep_type_t ch_ep_type = (usb_core_ep_type_t)hcchar_ep_type;
  uint32_t channel_enable = (USB_OTG_CHANNEL(instance, p_ch->ch_num)->HCCHAR & USB_OTG_HCCHAR_CHENA) >> 31;
  uint32_t split_enable = (USB_OTG_CHANNEL(instance, p_ch->ch_num)->HCSPLT & USB_OTG_HCSPLT_SPLITEN) >> 31;
  uint32_t dma_enable = (p_usb->GAHBCFG & USB_OTG_GAHBCFG_DMAEN) >> 0x5U;
  volatile uint32_t count = 0U;

  /* In buffer DMA, Channel disable must not be programmed for non-split periodic channels.
     At the end of the next uframe/frame (in the worst case), the core generates a channel halted
     and disables the channel automatically. */

  if (((channel_enable == 0U) || (((ch_ep_type == USB_CORE_EP_TYPE_ISOC) || (ch_ep_type == USB_CORE_EP_TYPE_INTR))))
      && ((dma_enable == 1U) && (split_enable == 0U)))
  {
    return USB_CORE_OK;
  }

  /* Check for space in the request queue to issue the halt. */
  if ((ch_ep_type == USB_CORE_EP_TYPE_CTRL) || (ch_ep_type == USB_CORE_EP_TYPE_BULK))
  {
    USB_OTG_CHANNEL(instance, p_ch->ch_num)->HCCHAR |= USB_OTG_HCCHAR_CHDIS;

    if (dma_enable == 0U)
    {
      if ((p_usb->HNPTXSTS & (0xFFU << 16)) == 0U)
      {
        USB_OTG_CHANNEL(instance, p_ch->ch_num)->HCCHAR &= ~USB_OTG_HCCHAR_CHENA;
        USB_OTG_CHANNEL(instance, p_ch->ch_num)->HCCHAR |= USB_OTG_HCCHAR_CHENA;
        do
        {
          count++;

          if (count > 1000U)
          {
            break;
          }
        } while ((USB_OTG_CHANNEL(instance, p_ch->ch_num)->HCCHAR & USB_OTG_HCCHAR_CHENA) == USB_OTG_HCCHAR_CHENA);
      }
      else
      {
        USB_OTG_CHANNEL(instance, p_ch->ch_num)->HCCHAR |= USB_OTG_HCCHAR_CHENA;
      }
    }
    else
    {
      USB_OTG_CHANNEL(instance, p_ch->ch_num)->HCCHAR |= USB_OTG_HCCHAR_CHENA;
    }
  }
  else
  {
    USB_OTG_CHANNEL(instance, p_ch->ch_num)->HCCHAR |= USB_OTG_HCCHAR_CHDIS;

    if ((USB_OTG_HOST(instance)->HPTXSTS & (0xFFU << 16)) == 0U)
    {
      USB_OTG_CHANNEL(instance, p_ch->ch_num)->HCCHAR &= ~USB_OTG_HCCHAR_CHENA;
      USB_OTG_CHANNEL(instance, p_ch->ch_num)->HCCHAR |= USB_OTG_HCCHAR_CHENA;
      do
      {
        count++;

        if (count > 1000U)
        {
          break;
        }
      } while ((USB_OTG_CHANNEL(instance, p_ch->ch_num)->HCCHAR & USB_OTG_HCCHAR_CHENA) == USB_OTG_HCCHAR_CHENA);
    }
    else
    {
      USB_OTG_CHANNEL(instance, p_ch->ch_num)->HCCHAR |= USB_OTG_HCCHAR_CHENA;
    }
  }

  return USB_CORE_OK;
}

/**
  * @brief  Initiate Do Ping protocol
  * @param  instance  Selected device
  * @param  ch_num  Host Channel number
  *         This parameter can be a value from 1 to 15
  * @retval OTG Core status
  */
usb_core_status_t USB_OTG_DoPing(uint32_t instance, usb_core_channel_t ch_num)
{
  uint32_t num_packets = 1U;
  uint32_t hcchar_reg;

  USB_OTG_CHANNEL(instance, ch_num)->HCTSIZ = ((num_packets << 19) & USB_OTG_HCTSIZ_PKTCNT) | USB_OTG_HCTSIZ_DOPING;

  /* Set host channel enable */
  hcchar_reg = USB_OTG_CHANNEL(instance, ch_num)->HCCHAR;
  hcchar_reg &= ~USB_OTG_HCCHAR_CHDIS;
  hcchar_reg |= USB_OTG_HCCHAR_CHENA;
  USB_OTG_CHANNEL(instance, ch_num)->HCCHAR = hcchar_reg;

  return USB_CORE_OK;
}

/**
  * @brief  Start Host Core
  * @param  instance  Selected device
  * @retval OTG Core status
  */
usb_core_status_t USB_OTG_StartHost(uint32_t instance)
{
  /* Enable port power */
  (void)USB_OTG_PortPower(instance, 1U);

