STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_usb_otg_core.c
  /* Enable global interrupt */
  (void)USB_OTG_EnableGlobalInterrupt(instance);

  return USB_CORE_OK;
}

/**
  * @brief  Stop Host Core
  * @param  instance  Selected device
  * @retval OTG Core status
  */
usb_core_status_t USB_OTG_StopHost(uint32_t instance)
{
  usb_core_status_t ret = USB_CORE_OK;
  usb_otg_global_t *p_usb = USB_OTG_GET_INSTANCE(instance);
  __IO uint32_t count = 0U;
  uint32_t hcchar_reg;
  uint32_t ch_idx;

  (void)USB_OTG_DisableGlobalInterrupt(instance);

  /* Flush USB FIFO */
  if (USB_OTG_FlushTxFifo(instance, 0x10U) != USB_CORE_OK) /* all Tx FIFOs */
  {
    ret = USB_CORE_ERROR;
  }

  if (USB_OTG_FlushRxFifo(instance) != USB_CORE_OK)
  {
    ret = USB_CORE_ERROR;
  }

  /* Flush out any leftover queued requests. */
  for (ch_idx = 0U; ch_idx <= 15U; ch_idx++)
  {
    hcchar_reg = USB_OTG_CHANNEL(instance, ch_idx)->HCCHAR;
    hcchar_reg |=  USB_OTG_HCCHAR_CHDIS;
    hcchar_reg &= ~USB_OTG_HCCHAR_CHENA;
    hcchar_reg &= ~USB_OTG_HCCHAR_EPDIR;
    USB_OTG_CHANNEL(instance, ch_idx)->HCCHAR = hcchar_reg;
  }

  /* Halt all channels to put them into a known state. */
  for (ch_idx = 0U; ch_idx <= 15U; ch_idx++)
  {
    hcchar_reg = USB_OTG_CHANNEL(instance, ch_idx)->HCCHAR;
    hcchar_reg |= USB_OTG_HCCHAR_CHDIS;
    hcchar_reg |= USB_OTG_HCCHAR_CHENA;
    hcchar_reg &= ~USB_OTG_HCCHAR_EPDIR;
    USB_OTG_CHANNEL(instance, ch_idx)->HCCHAR = hcchar_reg;

    do
    {
      count++;

      if (count > 1000U)
      {
        break;
      }
    } while ((USB_OTG_CHANNEL(instance, ch_idx)->HCCHAR & USB_OTG_HCCHAR_CHENA) == USB_OTG_HCCHAR_CHENA);
  }

  /* Clear any pending Host interrupts */
  USB_OTG_HOST(instance)->HAINT = USB_OTG_CLEAR_INTERRUPT_MASK;
  p_usb->GINTSTS = USB_OTG_CLEAR_INTERRUPT_MASK;

  (void)USB_OTG_EnableGlobalInterrupt(instance);

  return ret;
}

/**
  * @brief  Return Host Core port speed
  * @param  instance  Selected device
  * @retval port_speed : Host port speed
  *          This parameter can be one of these values:
  *            @arg USB_CORE_PORT_SPEED_HS: High speed mode
  *            @arg USB_CORE_PORT_SPEED_FS: Full speed mode
  *            @arg USB_CORE_PORT_SPEED_LS: Low speed mode
  */
usb_core_port_speed_t USB_OTG_GetHostPortSpeed(uint32_t instance)
{
  __IO uint32_t hprt0 = 0U;
  uint32_t port_speed;

  hprt0 = USB_OTG_HPRT0(instance);

  port_speed = ((hprt0 & USB_OTG_HPRT_PSPD) >> 17);

  return (usb_core_port_speed_t)port_speed;
}

/**
  * @brief  Return Host Current Frame number
  * @param  instance  Selected device
  * @retval current frame number
  */
uint32_t USB_OTG_GetCurrentFrame(uint32_t instance)
{
  return (USB_OTG_HOST(instance)->HFNUM & USB_OTG_HFNUM_FRNUM);
}

/**
  * @brief Read all host channel interrupts status
  * @param  instance  Selected device
  * @retval host interrupt value
  */
uint32_t USB_OTG_GetChannelInterrupt(uint32_t instance)
{
  return ((USB_OTG_HOST(instance)->HAINT) & 0xFFFFU);
}

/**
  * @brief  Return USB channel interrupt status
  * @param  instance  Selected device
  * @param  ch_num Channel number
  * @retval USB Channel Interrupt status
  */
uint32_t USB_OTG_ReadChannelInterrupts(uint32_t instance, usb_core_channel_t ch_num)
{
  uint32_t hcint_reg;

  hcint_reg = USB_OTG_CHANNEL(instance, ch_num)->HCINT;
  hcint_reg &= USB_OTG_CHANNEL(instance, ch_num)->HCINTMSK;

  return hcint_reg;
}

/**
  * @brief  USB_OTG_isEnabledDma: return the HCD DMA status enabled or disabled
  * @param  instance  Selected device
  * @retval HCD DMA status enabled or disabled
  */
uint32_t USB_OTG_GetDmaStatus(uint32_t instance)
{
  const usb_otg_global_t *p_usb = USB_OTG_GET_INSTANCE(instance);

  if ((p_usb->GAHBCFG & USB_OTG_GAHBCFG_DMAEN) == USB_OTG_GAHBCFG_DMAEN)
  {
    return (uint32_t)USB_CORE_CONFIG_ENABLED;
  }
  else
  {
    return (uint32_t)USB_CORE_CONFIG_DISABLED;
  }
}


/**
  * @brief  Reset Host Port
  * @param  instance  Selected device
  * @param  reset_status Host Port reset status
  * @retval USB_CORE_OK
  * @note (1)The application must wait at least 10 ms
  *   before clearing the reset bit.
  */
usb_core_status_t USB_OTG_PortReset(uint32_t instance, usb_core_port_reset_sts_t reset_status)
{
  __IO uint32_t hprt0 = 0U;

  hprt0 = USB_OTG_HPRT0(instance);

  hprt0 &= ~(USB_OTG_HPRT_PENA | USB_OTG_HPRT_PCDET |
             USB_OTG_HPRT_PENCHNG | USB_OTG_HPRT_POCCHNG);

  if (reset_status == USB_CORE_PORT_RESET_STS_SET)
  {
    USB_OTG_HPRT0(instance) = (USB_OTG_HPRT_PRST | hprt0);
  }
  else
  {
    USB_OTG_HPRT0(instance) = ((~USB_OTG_HPRT_PRST) & hprt0);
  }

  return USB_CORE_OK;
}

/**
  * @brief  Suspend Host Port
  * @param  instance  Selected device
  * @retval OTG Core status
  */
usb_core_status_t USB_OTG_PortSuspend(uint32_t instance)
{
  STM32_UNUSED(instance);

  return USB_CORE_OK;
}

/**
  * @brief  Resume Host Port
  * @param  instance  Selected device
  * @param  resume_status  Resume OTG Core status
  * @retval OTG Core status
  */
usb_core_status_t USB_OTG_PortResume(uint32_t instance, usb_core_port_resume_sts_t resume_status)
{
  STM32_UNUSED(instance);
  STM32_UNUSED(resume_status);

  return USB_CORE_OK;
}

/**
  * @brief  activate or de-activate Port Power
  * @param  instance  Selected device
  * @param  state  Port Power state
  *          This parameter can be one of these values:
  *           0 : Deactivate Port Power
  *           1 : Activate Port Power
  * @retval OTG Core status
  */
usb_core_status_t USB_OTG_PortPower(uint32_t instance, uint8_t state)
{
  __IO uint32_t hprt0 = 0U;

  hprt0 = USB_OTG_HPRT0(instance);

  hprt0 &= ~(USB_OTG_HPRT_PENA | USB_OTG_HPRT_PCDET |
             USB_OTG_HPRT_PENCHNG | USB_OTG_HPRT_POCCHNG);

  if (((hprt0 & USB_OTG_HPRT_PPWR) == 0U) && (state == 1U))
  {
    USB_OTG_HPRT0(instance) = (USB_OTG_HPRT_PPWR | hprt0);
  }

  if (((hprt0 & USB_OTG_HPRT_PPWR) == USB_OTG_HPRT_PPWR) && (state == 0U))
  {
    USB_OTG_HPRT0(instance) = ((~USB_OTG_HPRT_PPWR) & hprt0);
  }

  return USB_CORE_OK;
}

/**
  * @}
  */

/**
  * @}
  */

#endif /* defined (USB_OTG_FS) || defined (USB_OTG_HS) */
/**
  * @}
  */
